PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/**
 * \file ifx_se_psacrypto_values.h
 * \version 1.1.0
 *
 * \brief PSA cryptography module: macros to build and analyze integer values.
 *
 * \note This file may not be included directly. Applications must
 * include ifx_se_psacrypto.h.
 *
 * This file contains portable definitions of macros to build and analyze
 * values of integral types that encode properties of cryptographic keys,
 * designations of cryptographic algorithms, and error codes returned by
 * the library.
 *
 * This header file only defines pre-processor macros.
 *
 *******************************************************************************
 * \copyright
 * Copyright 2022-2024, Cypress Semiconductor Corporation (an Infineon company).
 * All rights reserved.
 * You may use this file only in accordance with the license, terms, conditions,
 * disclaimers, and limitations in the end user license agreement accompanying
 * the software package with which this file was provided.
 *******************************************************************************
*/

/*
 *  Copyright The Mbed TLS Contributors
 *  SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  (http)www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

#ifndef IFX_SE_PSACRYPTO_VALUES_H
#define IFX_SE_PSACRYPTO_VALUES_H

#include "ifx_se_syscall.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Directive 4.9', 3, \
                             'Use function-like macro as simple inline functions.')

/** \addtogroup psacrypto_error
 * @{
 */

/** An error occurred that does not correspond to any defined
 * failure cause.
 *
 * Implementations may use this error code if none of the other standard
 * error codes are applicable. */
#define IFX_SE_ERROR_GENERIC_ERROR         (IFX_SE_ERROR_CODE(-132))

/** The requested operation or a parameter is not supported
 * by this implementation.
 *
 * Implementations should return this error code when an enumeration
 * parameter such as a key type, algorithm, etc. is not recognized.
 * If a combination of parameters is recognized and identified as
 * not valid, return #IFX_SE_ERROR_INVALID_ARGUMENT instead. */
#define IFX_SE_ERROR_NOT_SUPPORTED         (IFX_SE_ERROR_CODE(-134))

/** The requested action is denied by a policy.
 *
 * Implementations should return this error code when the parameters
 * are recognized as valid and supported, and a policy explicitly
 * denies the requested operation.
 *
 * If a subset of the parameters of a function call identify a
 * forbidden operation, and another subset of the parameters are
 * not valid or not supported, it is unspecified whether the function
 * returns #IFX_SE_ERROR_NOT_PERMITTED, #IFX_SE_ERROR_NOT_SUPPORTED or
 * #IFX_SE_ERROR_INVALID_ARGUMENT. */
#define IFX_SE_ERROR_NOT_PERMITTED         (IFX_SE_ERROR_CODE(-133))

/** An output buffer is too small.
 *
 * Applications can call the \c IFX_SE_xxx_SIZE macro listed in the function
 * description to determine a sufficient buffer size.
 *
 * Implementations should preferably return this error code only
 * in cases when performing the operation with a larger output
 * buffer would succeed. However implementations may return this
 * error if a function has invalid or unsupported parameters in addition
 * to the parameters that determine the necessary output buffer size. */
#define IFX_SE_ERROR_BUFFER_TOO_SMALL      (IFX_SE_ERROR_CODE(-138))

/** Asking for an item that already exists
 *
 * Implementations should return this error, when attempting
 * to write an item (like a key) that already exists. */
#define IFX_SE_ERROR_ALREADY_EXISTS        (IFX_SE_ERROR_CODE(-139))

/** Asking for an item that doesn't exist
 *
 * Implementations should return this error, if a requested item (like
 * a key) does not exist. */
#define IFX_SE_ERROR_DOES_NOT_EXIST        (IFX_SE_ERROR_CODE(-140))

/** The requested action cannot be performed in the current state.
 *
 * Multipart operations return this error when one of the
 * functions is called out of sequence. Refer to the function
 * descriptions for permitted sequencing of functions.
 *
 * Implementations shall not return this error code to indicate
 * that a key either exists or not,
 * but shall instead return #IFX_SE_ERROR_ALREADY_EXISTS or #IFX_SE_ERROR_DOES_NOT_EXIST
 * as applicable.
 *
 * Implementations shall not return this error code to indicate that a
 * key identifier is invalid, but shall return #IFX_SE_ERROR_INVALID_HANDLE
 * instead. */
#define IFX_SE_ERROR_BAD_STATE             (IFX_SE_ERROR_CODE(-137))

/** The parameters passed to the function are invalid.
 *
 * Implementations may return this error any time a parameter or
 * combination of parameters are recognized as invalid.
 *
 * Implementations shall not return this error code to indicate that a
 * key identifier is invalid, but shall return #IFX_SE_ERROR_INVALID_HANDLE
 * instead.
 */
#define IFX_SE_ERROR_INVALID_ARGUMENT      (IFX_SE_ERROR_CODE(-135))

/** There is not enough runtime memory.
 *
 * If the action is carried out across multiple security realms, this
 * error can refer to available memory in any of the security realms. */
#define IFX_SE_ERROR_INSUFFICIENT_MEMORY   (IFX_SE_ERROR_CODE(-141))

/** There is not enough persistent storage.
 *
 * Functions that modify the key storage return this error code if
 * there is insufficient storage space on the host media. In addition,
 * many functions that do not otherwise access storage may return this
 * error code if the implementation requires a mandatory log entry for
 * the requested action and the log storage space is full. */
#define IFX_SE_ERROR_INSUFFICIENT_STORAGE  (IFX_SE_ERROR_CODE(-142))

