PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Return this error when there's insufficient data when attempting
 * to read from a resource. */
#define IFX_SE_ERROR_INSUFFICIENT_DATA     (IFX_SE_ERROR_CODE(-143))

/** The key identifier is not valid. See also :ref:\`key-handles\`.
 */
#define IFX_SE_ERROR_INVALID_HANDLE        (IFX_SE_ERROR_CODE(-136))

/** Stored data has been corrupted.
 *
 * This error indicates that some persistent storage has suffered corruption.
 * It does not indicate the following situations, which have specific error
 * codes:
 *
 * - A corruption of volatile memory - use #IFX_SE_ERROR_CORRUPTION_DETECTED.
 * - A communication error between the cryptoprocessor and its external
 *   storage - use #IFX_SE_ERROR_COMMUNICATION_FAILURE.
 * - When the storage is in a valid state but is full - use
 *   #IFX_SE_ERROR_INSUFFICIENT_STORAGE.
 * - When the storage fails for other reasons - use
 *   #IFX_SE_ERROR_STORAGE_FAILURE.
 * - When the stored data is not valid - use #IFX_SE_ERROR_DATA_INVALID.
 *
 * \note A storage corruption does not indicate that any data that was
 * previously read is invalid. However this previously read data might no
 * longer be readable from storage.
 *
 * When a storage failure occurs, it is no longer possible to ensure the
 * global integrity of the keystore.
 */
#define IFX_SE_ERROR_DATA_CORRUPT          (IFX_SE_ERROR_CODE(-152))

/** Data read from storage is not valid for the implementation.
 *
 * This error indicates that some data read from storage does not have a valid
 * format. It does not indicate the following situations, which have specific
 * error codes:
 *
 * - When the storage or stored data is corrupted - use #IFX_SE_ERROR_DATA_CORRUPT
 * - When the storage fails for other reasons - use #IFX_SE_ERROR_STORAGE_FAILURE
 * - An invalid argument to the API - use #IFX_SE_ERROR_INVALID_ARGUMENT
 *
 * This error is typically a result of either storage corruption on a
 * cleartext storage backend, or an attempt to read data that was
 * written by an incompatible version of the library.
 */
#define IFX_SE_ERROR_DATA_INVALID          (IFX_SE_ERROR_CODE(-153))

/**@}*/

/** \addtogroup crypto_types
 * @{
 */

/** An invalid key type value.
 *
 * Zero is not the encoding of any key type.
 */
#define IFX_SE_KEY_TYPE_NONE                           ((ifx_se_key_type_t)0x0000)

/** Vendor-defined key type flag.
 *
 * Key types defined by this standard will never have the
 * #IFX_SE_KEY_TYPE_VENDOR_FLAG bit set. Vendors who define additional key types
 * must use an encoding with the #IFX_SE_KEY_TYPE_VENDOR_FLAG bit set and should
 * respect the bitwise structure used by standard encodings whenever practical.
 */
#define IFX_SE_KEY_TYPE_VENDOR_FLAG                    ((ifx_se_key_type_t)0x8000)

/** \cond INTERNAL */
#define IFX_SE_KEY_TYPE_CATEGORY_MASK                  ((ifx_se_key_type_t)0x7000)
#define IFX_SE_KEY_TYPE_CATEGORY_RAW                   ((ifx_se_key_type_t)0x1000)
#define IFX_SE_KEY_TYPE_CATEGORY_SYMMETRIC             ((ifx_se_key_type_t)0x2000)
#define IFX_SE_KEY_TYPE_CATEGORY_PUBLIC_KEY            ((ifx_se_key_type_t)0x4000)
#define IFX_SE_KEY_TYPE_CATEGORY_KEY_PAIR              ((ifx_se_key_type_t)0x7000)

#define IFX_SE_KEY_TYPE_CATEGORY_FLAG_PAIR             ((ifx_se_key_type_t)0x3000)
/** \endcond */

/** Whether a key type is vendor-defined.
 *
 * See also #IFX_SE_KEY_TYPE_VENDOR_FLAG.
 */
#define IFX_SE_KEY_TYPE_IS_VENDOR_DEFINED(type) \
    (((type) & IFX_SE_KEY_TYPE_VENDOR_FLAG) != 0)

/** Whether a key type is an unstructured array of bytes.
 *
 * This encompasses both symmetric keys and non-key data.
 */
#define IFX_SE_KEY_TYPE_IS_UNSTRUCTURED(type) \
    (((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK) == IFX_SE_KEY_TYPE_CATEGORY_RAW || \
     ((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK) == IFX_SE_KEY_TYPE_CATEGORY_SYMMETRIC)

/** Whether a key type is asymmetric: either a key pair or a public key. */
#define IFX_SE_KEY_TYPE_IS_ASYMMETRIC(type)                                \
    (((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK                               \
      & ~IFX_SE_KEY_TYPE_CATEGORY_FLAG_PAIR) ==                            \
     IFX_SE_KEY_TYPE_CATEGORY_PUBLIC_KEY)
/** Whether a key type is the public part of a key pair. */
#define IFX_SE_KEY_TYPE_IS_PUBLIC_KEY(type)                                \
    (((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK) == IFX_SE_KEY_TYPE_CATEGORY_PUBLIC_KEY)
/** Whether a key type is a key pair containing a private part and a public
 * part. */
#define IFX_SE_KEY_TYPE_IS_KEY_PAIR(type)                                   \
    (((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK) == IFX_SE_KEY_TYPE_CATEGORY_KEY_PAIR)
/** The key pair type corresponding to a public key type.
 *
 * You may also pass a key pair type as \p type, it will be left unchanged.
 *
 * \param type      A public key type or key pair type.
 *
 * \return          The corresponding key pair type.
 *                  If \p type is not a public key or a key pair,
 *                  the return value is undefined.
 */
#define IFX_SE_KEY_TYPE_KEY_PAIR_OF_PUBLIC_KEY(type)        \
    ((type) | IFX_SE_KEY_TYPE_CATEGORY_FLAG_PAIR)
/** The public key type corresponding to a key pair type.
 *
 * You may also pass a key pair type as \p type, it will be left unchanged.
 *
 * \param type      A public key type or key pair type.
 *
 * \return          The corresponding public key type.
 *                  If \p type is not a public key or a key pair,
 *                  the return value is undefined.
 */
#define IFX_SE_KEY_TYPE_PUBLIC_KEY_OF_KEY_PAIR(type)        \
    ((type) & ~IFX_SE_KEY_TYPE_CATEGORY_FLAG_PAIR)

/** Raw data.
 *
 * A "key" of this type cannot be used for any cryptographic operation.
 * Applications may use this type to store arbitrary data in the keystore. */
#define IFX_SE_KEY_TYPE_RAW_DATA                       ((ifx_se_key_type_t)0x1001)

/** HMAC key.
 *
 * The key policy determines which underlying hash algorithm the key can be
 * used for.
 *
 * HMAC keys should generally have the same size as the underlying hash.
 * This size can be calculated with #IFX_SE_HASH_LENGTH(\c alg) where
 * \c alg is the HMAC algorithm or the underlying hash algorithm. */
#define IFX_SE_KEY_TYPE_HMAC                           ((ifx_se_key_type_t)0x1100)

