PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** A secret for key derivation.
 *
 * This key type is for high-entropy secrets only. For low-entropy secrets,
 * #IFX_SE_KEY_TYPE_PASSWORD should be used instead.
 *
 * These keys can be used as the #IFX_SE_KEY_DERIVATION_INPUT_SECRET or
 * #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD input of key derivation algorithms.
 *
 * The key policy determines which key derivation algorithm the key
 * can be used for.
 */
#define IFX_SE_KEY_TYPE_DERIVE                         ((ifx_se_key_type_t)0x1200)

/** A low-entropy secret for password hashing or key derivation.
 *
 * This key type is suitable for passwords and passphrases which are typically
 * intended to be memorizable by humans, and have a low entropy relative to
 * their size. It can be used for randomly generated or derived keys with
 * maximum or near-maximum entropy, but #IFX_SE_KEY_TYPE_DERIVE is more suitable
 * for such keys. It is not suitable for passwords with extremely low entropy,
 * such as numerical PINs.
 *
 * These keys can be used as the #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD input of
 * key derivation algorithms. Algorithms that accept such an input were
 * designed to accept low-entropy secret and are known as password hashing or
 * key stretching algorithms.
 *
 * These keys cannot be used as the #IFX_SE_KEY_DERIVATION_INPUT_SECRET input of
 * key derivation algorithms, as the algorithms that take such an input expect
 * it to be high-entropy.
 *
 * The key policy determines which key derivation algorithm the key can be
 * used for, among the permissible subset defined above.
 */
#define IFX_SE_KEY_TYPE_PASSWORD                       ((ifx_se_key_type_t)0x1203)

/** A secret value that can be used to verify a password hash.
 *
 * The key policy determines which key derivation algorithm the key
 * can be used for, among the same permissible subset as for
 * #IFX_SE_KEY_TYPE_PASSWORD.
 */
#define IFX_SE_KEY_TYPE_PASSWORD_HASH                  ((ifx_se_key_type_t)0x1205)

/** A secret value that can be used in when computing a password hash.
 *
 * The key policy determines which key derivation algorithm the key
 * can be used for, among the subset of algorithms that can use pepper.
 */
#define IFX_SE_KEY_TYPE_PEPPER                         ((ifx_se_key_type_t)0x1206)

/** Key for a cipher, AEAD or MAC algorithm based on the AES block cipher.
 *
 * The size of the key can be 16 bytes (AES-128), 24 bytes (AES-192) or
 * 32 bytes (AES-256).
 */
#define IFX_SE_KEY_TYPE_AES                            ((ifx_se_key_type_t)0x2400)

/** Key for a cipher, AEAD or MAC algorithm based on the
 * ARIA block cipher. */
#define IFX_SE_KEY_TYPE_ARIA                           ((ifx_se_key_type_t)0x2406)

/** Key for a cipher or MAC algorithm based on DES or 3DES (Triple-DES).
 *
 * The size of the key can be 64 bits (single DES), 128 bits (2-key 3DES) or
 * 192 bits (3-key 3DES).
 *
 * Note that single DES and 2-key 3DES are weak and strongly
 * deprecated and should only be used to decrypt legacy data. 3-key 3DES
 * is weak and deprecated and should only be used in legacy protocols.
 */
#define IFX_SE_KEY_TYPE_DES                            ((ifx_se_key_type_t)0x2301)

/** Key for a cipher, AEAD or MAC algorithm based on the
 * Camellia block cipher. */
#define IFX_SE_KEY_TYPE_CAMELLIA                       ((ifx_se_key_type_t)0x2403)

/** Key for the ChaCha20 stream cipher or the Chacha20-Poly1305 AEAD algorithm.
 *
 * ChaCha20 and the ChaCha20_Poly1305 construction are defined in RFC 7539.
 *
 * \note For ChaCha20 and ChaCha20_Poly1305, Mbed TLS only supports
 *       12-byte nonces.
 *
 * \note For ChaCha20, the initial counter value is 0. To encrypt or decrypt
 *       with the initial counter value 1, you can process and discard a
 *       64-byte block before the real data.
 */
#define IFX_SE_KEY_TYPE_CHACHA20                       ((ifx_se_key_type_t)0x2004)

/** RSA public key.
 *
 * The size of an RSA key is the bit size of the modulus.
 */
#define IFX_SE_KEY_TYPE_RSA_PUBLIC_KEY                 ((ifx_se_key_type_t)0x4001)
/** RSA key pair (private and public key).
 *
 * The size of an RSA key is the bit size of the modulus.
 */
#define IFX_SE_KEY_TYPE_RSA_KEY_PAIR                   ((ifx_se_key_type_t)0x7001)
/** Whether a key type is an RSA key (pair or public-only). */
#define IFX_SE_KEY_TYPE_IS_RSA(type)                                       \
    (IFX_SE_KEY_TYPE_PUBLIC_KEY_OF_KEY_PAIR(type) == IFX_SE_KEY_TYPE_RSA_PUBLIC_KEY)

/** \cond INTERNAL */
#define IFX_SE_KEY_TYPE_ECC_PUBLIC_KEY_BASE            ((ifx_se_key_type_t)0x4100)
#define IFX_SE_KEY_TYPE_ECC_KEY_PAIR_BASE              ((ifx_se_key_type_t)0x7100)
#define IFX_SE_KEY_TYPE_ECC_CURVE_MASK                 ((ifx_se_key_type_t)0x00ff)
/** \endcond */

/** Elliptic curve key pair.
 *
 * The size of an elliptic curve key is the bit size associated with the curve,
 * i.e. the bit size of *q* for a curve over a field *F<sub>q</sub>*.
 * See the documentation of `IFX_SE_ECC_FAMILY_xxx` curve families for details.
 *
 * \param curve     A value of type ::ifx_se_ecc_family_t that
 *                  identifies the ECC curve to be used.
 */
#define IFX_SE_KEY_TYPE_ECC_KEY_PAIR(curve)         \
    (IFX_SE_KEY_TYPE_ECC_KEY_PAIR_BASE | (curve))
/** Elliptic curve public key.
 *
 * The size of an elliptic curve public key is the same as the corresponding
 * private key (see #IFX_SE_KEY_TYPE_ECC_KEY_PAIR and the documentation of
 * `IFX_SE_ECC_FAMILY_xxx` curve families).
 *
 * \param curve     A value of type ::ifx_se_ecc_family_t that
 *                  identifies the ECC curve to be used.
 */
#define IFX_SE_KEY_TYPE_ECC_PUBLIC_KEY(curve)              \
    (IFX_SE_KEY_TYPE_ECC_PUBLIC_KEY_BASE | (curve))

/** Whether a key type is an elliptic curve key (pair or public-only). */
#define IFX_SE_KEY_TYPE_IS_ECC(type)                                       \
    ((IFX_SE_KEY_TYPE_PUBLIC_KEY_OF_KEY_PAIR(type) &                        \
      ~IFX_SE_KEY_TYPE_ECC_CURVE_MASK) == IFX_SE_KEY_TYPE_ECC_PUBLIC_KEY_BASE)
/** Whether a key type is an elliptic curve key pair. */
#define IFX_SE_KEY_TYPE_IS_ECC_KEY_PAIR(type)                               \
    (((type) & ~IFX_SE_KEY_TYPE_ECC_CURVE_MASK) ==                         \
     IFX_SE_KEY_TYPE_ECC_KEY_PAIR_BASE)
/** Whether a key type is an elliptic curve public key. */
#define IFX_SE_KEY_TYPE_IS_ECC_PUBLIC_KEY(type)                            \
    (((type) & ~IFX_SE_KEY_TYPE_ECC_CURVE_MASK) ==                         \
     IFX_SE_KEY_TYPE_ECC_PUBLIC_KEY_BASE)

