PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Extract the curve from an elliptic curve key type. */
#define IFX_SE_KEY_TYPE_ECC_GET_FAMILY(type)                        \
    ((ifx_se_ecc_family_t) (IFX_SE_KEY_TYPE_IS_ECC(type) ?             \
                        ((type) & IFX_SE_KEY_TYPE_ECC_CURVE_MASK) : \
                        0))

/** Check if the curve of given family is Weierstrass elliptic curve. */
#define IFX_SE_ECC_FAMILY_IS_WEIERSTRASS(family) ((family & 0xc0) == 0)

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 3.1', 4, \
                             'The character sequence "//" is a part of http URL.')

/** SEC Koblitz curves over prime fields.
 *
 * This family comprises the following curves:
 * secp192k1, secp224k1, secp256k1.
 * They are defined in _Standards for Efficient Cryptography_,
 * _SEC 2: Recommended Elliptic Curve Domain Parameters_.
 * https://www.secg.org/sec2-v2.pdf
 */
#define IFX_SE_ECC_FAMILY_SECP_K1           ((ifx_se_ecc_family_t) 0x17)

/** SEC random curves over prime fields.
 *
 * This family comprises the following curves:
 * secp192k1, secp224r1, secp256r1, secp384r1, secp521r1.
 * They are defined in _Standards for Efficient Cryptography_,
 * _SEC 2: Recommended Elliptic Curve Domain Parameters_.
 * https://www.secg.org/sec2-v2.pdf
 */
#define IFX_SE_ECC_FAMILY_SECP_R1           ((ifx_se_ecc_family_t) 0x12)
/** SECP160R2 (SEC2 v1, obsolete) */
#define IFX_SE_ECC_FAMILY_SECP_R2           ((ifx_se_ecc_family_t) 0x1b)

/** SEC Koblitz curves over binary fields.
 *
 * This family comprises the following curves:
 * sect163k1, sect233k1, sect239k1, sect283k1, sect409k1, sect571k1.
 * They are defined in _Standards for Efficient Cryptography_,
 * _SEC 2: Recommended Elliptic Curve Domain Parameters_.
 * https://www.secg.org/sec2-v2.pdf
 */
#define IFX_SE_ECC_FAMILY_SECT_K1           ((ifx_se_ecc_family_t) 0x27)

/** SEC random curves over binary fields.
 *
 * This family comprises the following curves:
 * sect163r1, sect233r1, sect283r1, sect409r1, sect571r1.
 * They are defined in _Standards for Efficient Cryptography_,
 * _SEC 2: Recommended Elliptic Curve Domain Parameters_.
 * https://www.secg.org/sec2-v2.pdf
 */
#define IFX_SE_ECC_FAMILY_SECT_R1           ((ifx_se_ecc_family_t) 0x22)

/** SEC additional random curves over binary fields.
 *
 * This family comprises the following curve:
 * sect163r2.
 * It is defined in _Standards for Efficient Cryptography_,
 * _SEC 2: Recommended Elliptic Curve Domain Parameters_.
 * https://www.secg.org/sec2-v2.pdf
 */
#define IFX_SE_ECC_FAMILY_SECT_R2           ((ifx_se_ecc_family_t) 0x2b)

/** Brainpool P random curves.
 *
 * This family comprises the following curves:
 * brainpoolP160r1, brainpoolP192r1, brainpoolP224r1, brainpoolP256r1,
 * brainpoolP320r1, brainpoolP384r1, brainpoolP512r1.
 * It is defined in RFC 5639.
 */
#define IFX_SE_ECC_FAMILY_BRAINPOOL_P_R1    ((ifx_se_ecc_family_t) 0x30)

/** Curve25519 and Curve448.
 *
 * This family comprises the following Montgomery curves:
 * - 255-bit: Bernstein et al.,
 *   _Curve25519: new Diffie-Hellman speed records_, LNCS 3958, 2006.
 *   The algorithm #IFX_SE_ALG_ECDH performs X25519 when used with this curve.
 * - 448-bit: Hamburg,
 *   _Ed448-Goldilocks, a new elliptic curve_, NIST ECC Workshop, 2015.
 *   The algorithm #IFX_SE_ALG_ECDH performs X448 when used with this curve.
 */
#define IFX_SE_ECC_FAMILY_MONTGOMERY        ((ifx_se_ecc_family_t) 0x41)

/** The twisted Edwards curves Ed25519 and Ed448.
 *
 * These curves are suitable for EdDSA (#IFX_SE_ALG_PURE_EDDSA for both curves,
 * #IFX_SE_ALG_ED25519PH for the 255-bit curve,
 * #IFX_SE_ALG_ED448PH for the 448-bit curve).
 *
 * This family comprises the following twisted Edwards curves:
 * - 255-bit: Edwards25519, the twisted Edwards curve birationally equivalent
 *   to Curve25519.
 *   Bernstein et al., _Twisted Edwards curves_, Africacrypt 2008.
 * - 448-bit: Edwards448, the twisted Edwards curve birationally equivalent
 *   to Curve448.
 *   Hamburg, _Ed448-Goldilocks, a new elliptic curve_, NIST ECC Workshop, 2015.
 */
#define IFX_SE_ECC_FAMILY_TWISTED_EDWARDS   ((ifx_se_ecc_family_t) 0x42)

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 3.1')

/** \cond INTERNAL */
#define IFX_SE_KEY_TYPE_DH_PUBLIC_KEY_BASE             ((ifx_se_key_type_t)0x4200)
#define IFX_SE_KEY_TYPE_DH_KEY_PAIR_BASE               ((ifx_se_key_type_t)0x7200)
#define IFX_SE_KEY_TYPE_DH_GROUP_MASK                  ((ifx_se_key_type_t)0x00ff)
#define IFX_SE_GET_KEY_TYPE_BLOCK_SIZE_EXPONENT(type)      \
    (((type) >> 8) & 7)
/** \endcond */

/** Diffie-Hellman key pair.
 *
 * \param group     A value of type ::ifx_se_dh_family_t that identifies the
 *                  Diffie-Hellman group to be used.
 */
#define IFX_SE_KEY_TYPE_DH_KEY_PAIR(group)          \
    (IFX_SE_KEY_TYPE_DH_KEY_PAIR_BASE | (group))
/** Diffie-Hellman public key.
 *
 * \param group     A value of type ::ifx_se_dh_family_t that identifies the
 *                  Diffie-Hellman group to be used.
 */
#define IFX_SE_KEY_TYPE_DH_PUBLIC_KEY(group)               \
    (IFX_SE_KEY_TYPE_DH_PUBLIC_KEY_BASE | (group))

/** Whether a key type is a Diffie-Hellman key (pair or public-only). */
#define IFX_SE_KEY_TYPE_IS_DH(type)                                        \
    ((IFX_SE_KEY_TYPE_PUBLIC_KEY_OF_KEY_PAIR(type) &                        \
      ~IFX_SE_KEY_TYPE_DH_GROUP_MASK) == IFX_SE_KEY_TYPE_DH_PUBLIC_KEY_BASE)
/** Whether a key type is a Diffie-Hellman key pair. */
#define IFX_SE_KEY_TYPE_IS_DH_KEY_PAIR(type)                               \
    (((type) & ~IFX_SE_KEY_TYPE_DH_GROUP_MASK) ==                         \
     IFX_SE_KEY_TYPE_DH_KEY_PAIR_BASE)
/** Whether a key type is a Diffie-Hellman public key. */
#define IFX_SE_KEY_TYPE_IS_DH_PUBLIC_KEY(type)                            \
    (((type) & ~IFX_SE_KEY_TYPE_DH_GROUP_MASK) ==                         \
     IFX_SE_KEY_TYPE_DH_PUBLIC_KEY_BASE)

/** Extract the group from a Diffie-Hellman key type. */
#define IFX_SE_KEY_TYPE_DH_GET_FAMILY(type)                        \
    ((ifx_se_dh_family_t) (IFX_SE_KEY_TYPE_IS_DH(type) ?              \
                       ((type) & IFX_SE_KEY_TYPE_DH_GROUP_MASK) :  \
                       0))

/** Diffie-Hellman groups defined in RFC 7919 Appendix A.
 *
 * This family includes groups with the following key sizes (in bits):
 * 2048, 3072, 4096, 6144, 8192. A given implementation may support
 * all of these sizes or only a subset.
 */
#define IFX_SE_DH_FAMILY_RFC7919            ((ifx_se_dh_family_t) 0x03)

/** The block size of a block cipher.
 *
 * \param type  A cipher key type (value of type #ifx_se_key_type_t).
 *
 * \return      The block size for a block cipher, or 1 for a stream cipher.
 *              The return value is undefined if \p type is not a supported
 *              cipher key type.
 *
 * \note It is possible to build stream cipher algorithms on top of a block
 *       cipher, for example CTR mode (#IFX_SE_ALG_CTR).
 *       This macro only takes the key type into account, so it cannot be
 *       used to determine the size of the data that #ifx_se_cipher_update()
 *       might buffer for future processing in general.
 *
 * \note This macro returns a compile-time constant if its argument is one.
 *
 * \warning This macro may evaluate its argument multiple times.
 */
#define IFX_SE_BLOCK_CIPHER_BLOCK_LENGTH(type)                                     \
    (((type) & IFX_SE_KEY_TYPE_CATEGORY_MASK) == IFX_SE_KEY_TYPE_CATEGORY_SYMMETRIC ? \
     1u << IFX_SE_GET_KEY_TYPE_BLOCK_SIZE_EXPONENT(type) :                         \
     0u)

