PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** \} */

/** \addtogroup crypto_algs
 * \{
 */

/** Vendor-defined algorithm flag.
 *
 * Algorithms defined by this standard will never have the #IFX_SE_ALG_VENDOR_FLAG
 * bit set. Vendors who define additional algorithms must use an encoding with
 * the #IFX_SE_ALG_VENDOR_FLAG bit set and should respect the bitwise structure
 * used by standard encodings whenever practical.
 */
#define IFX_SE_ALG_VENDOR_FLAG                     ((ifx_se_algorithm_t)0x80000000U)

/** \cond INTERNAL */
#define IFX_SE_ALG_CATEGORY_MASK                   ((ifx_se_algorithm_t)0x7f000000U)
#define IFX_SE_ALG_CATEGORY_HASH                   ((ifx_se_algorithm_t)0x02000000U)
#define IFX_SE_ALG_CATEGORY_MAC                    ((ifx_se_algorithm_t)0x03000000U)
#define IFX_SE_ALG_CATEGORY_CIPHER                 ((ifx_se_algorithm_t)0x04000000U)
#define IFX_SE_ALG_CATEGORY_AEAD                   ((ifx_se_algorithm_t)0x05000000U)
#define IFX_SE_ALG_CATEGORY_SIGN                   ((ifx_se_algorithm_t)0x06000000U)
#define IFX_SE_ALG_CATEGORY_ASYMMETRIC_ENCRYPTION  ((ifx_se_algorithm_t)0x07000000U)
#define IFX_SE_ALG_CATEGORY_KEY_DERIVATION         ((ifx_se_algorithm_t)0x08000000U)
#define IFX_SE_ALG_CATEGORY_KEY_AGREEMENT          ((ifx_se_algorithm_t)0x09000000U)
/** \endcond */

/** Whether an algorithm is vendor-defined.
 *
 * See also #IFX_SE_ALG_VENDOR_FLAG.
 */
#define IFX_SE_ALG_IS_VENDOR_DEFINED(alg)                                  \
    (((alg) & IFX_SE_ALG_VENDOR_FLAG) != 0)

/** Whether the specified algorithm is a hash algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a hash algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_HASH(alg)                                            \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_HASH)

/** Whether the specified algorithm is a MAC algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a MAC algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_MAC(alg)                                             \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_MAC)

/** Whether the specified algorithm is a symmetric cipher algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a symmetric cipher algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_CIPHER(alg)                                          \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_CIPHER)

/** Whether the specified algorithm is an authenticated encryption
 * with associated data (AEAD) algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is an AEAD algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_AEAD(alg)                                            \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_AEAD)

/** Whether the specified algorithm is an asymmetric signature algorithm,
 * also known as public-key signature algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is an asymmetric signature algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_SIGN(alg)                                            \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_SIGN)

/** Whether the specified algorithm is an asymmetric encryption algorithm,
 * also known as public-key encryption algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is an asymmetric encryption algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_ASYMMETRIC_ENCRYPTION(alg)                           \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_ASYMMETRIC_ENCRYPTION)

/** Whether the specified algorithm is a key agreement algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a key agreement algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_KEY_AGREEMENT(alg)                                   \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_KEY_AGREEMENT)

/** Whether the specified algorithm is a key derivation algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a key derivation algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_KEY_DERIVATION(alg)                                  \
    (((alg) & IFX_SE_ALG_CATEGORY_MASK) == IFX_SE_ALG_CATEGORY_KEY_DERIVATION)

/** Whether the specified algorithm is a key stretching / password hashing
 * algorithm.
 *
 * A key stretching / password hashing algorithm is a key derivation algorithm
 * that is suitable for use with a low-entropy secret such as a password.
 * Equivalently, it's a key derivation algorithm that uses a
 * #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD input step.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a key stretching / password hashing algorithm, 0
 *         otherwise. This macro may return either 0 or 1 if \p alg is not a
 *         supported algorithm identifier.
 */
#define IFX_SE_ALG_IS_KEY_DERIVATION_STRETCHING(alg)                                  \
    (IFX_SE_ALG_IS_KEY_DERIVATION(alg) &&              \
     (alg) & IFX_SE_ALG_KEY_DERIVATION_STRETCHING_FLAG)

