PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** An invalid algorithm identifier value. */
#define IFX_SE_ALG_NONE                            ((ifx_se_algorithm_t)0)

/** MASK */
#define IFX_SE_ALG_HASH_MASK                       ((ifx_se_algorithm_t)0x000000ff)
/** MD5 */
#define IFX_SE_ALG_MD5                             ((ifx_se_algorithm_t)0x02000003)
/** IFX_SE_ALG_RIPEMD160 */
#define IFX_SE_ALG_RIPEMD160                       ((ifx_se_algorithm_t)0x02000004)
/** SHA1 */
#define IFX_SE_ALG_SHA_1                           ((ifx_se_algorithm_t)0x02000005)
/** SHA2-224 */
#define IFX_SE_ALG_SHA_224                         ((ifx_se_algorithm_t)0x02000008)
/** SHA2-256 */
#define IFX_SE_ALG_SHA_256                         ((ifx_se_algorithm_t)0x02000009)
/** SHA2-384 */
#define IFX_SE_ALG_SHA_384                         ((ifx_se_algorithm_t)0x0200000a)
/** SHA2-512 */
#define IFX_SE_ALG_SHA_512                         ((ifx_se_algorithm_t)0x0200000b)
/** SHA2-512/224 */
#define IFX_SE_ALG_SHA_512_224                     ((ifx_se_algorithm_t)0x0200000c)
/** SHA2-512/256 */
#define IFX_SE_ALG_SHA_512_256                     ((ifx_se_algorithm_t)0x0200000d)
/** SHA3-224 */
#define IFX_SE_ALG_SHA3_224                        ((ifx_se_algorithm_t)0x02000010)
/** SHA3-256 */
#define IFX_SE_ALG_SHA3_256                        ((ifx_se_algorithm_t)0x02000011)
/** SHA3-384 */
#define IFX_SE_ALG_SHA3_384                        ((ifx_se_algorithm_t)0x02000012)
/** SHA3-512 */
#define IFX_SE_ALG_SHA3_512                        ((ifx_se_algorithm_t)0x02000013)
/** The first 512 bits (64 bytes) of the SHAKE256 output.
 *
 * This is the prehashing for Ed448ph (see #IFX_SE_ALG_ED448PH). For other
 * scenarios where a hash function based on SHA3/SHAKE is desired, SHA3-512
 * has the same output size and a (theoretically) higher security strength.
 */
#define IFX_SE_ALG_SHAKE256_512                    ((ifx_se_algorithm_t)0x02000015)

/** In a hash-and-sign algorithm policy, allow any hash algorithm.
 *
 * This value may be used to form the algorithm usage field of a policy
 * for a signature algorithm that is parametrized by a hash. The key
 * may then be used to perform operations using the same signature
 * algorithm parametrized with any supported hash.
 *
 * That is, suppose that `IFX_SE_xxx_SIGNATURE` is one of the following macros:
 * - #IFX_SE_ALG_RSA_PKCS1V15_SIGN, #IFX_SE_ALG_RSA_PSS, #IFX_SE_ALG_RSA_PSS_ANY_SALT,
 * - #IFX_SE_ALG_ECDSA, #IFX_SE_ALG_DETERMINISTIC_ECDSA.
 * Then you may create and use a key as follows:
 * - Set the key usage field using #IFX_SE_ALG_ANY_HASH, for example:
 *   ```
 *   ifx_se_set_key_usage_flags(&attributes, IFX_SE_KEY_USAGE_SIGN_HASH);
 *   ifx_se_set_key_algorithm(&attributes, IFX_SE_xxx_SIGNATURE(IFX_SE_ALG_ANY_HASH));
 *   ```
 * - Import or generate key material.
 * - Call ifx_se_sign_hash() or ifx_se_verify_hash(), passing
 *   an algorithm built from `IFX_SE_xxx_SIGNATURE` and a specific hash. Each
 *   call to sign or verify a message may use a different hash.
 *   ```
 *   ifx_se_sign_hash(key, IFX_SE_xxx_SIGNATURE(IFX_SE_ALG_SHA_256), ...);
 *   ifx_se_sign_hash(key, IFX_SE_xxx_SIGNATURE(IFX_SE_ALG_SHA_512), ...);
 *   ifx_se_sign_hash(key, IFX_SE_xxx_SIGNATURE(IFX_SE_ALG_SHA3_256), ...);
 *   ```
 *
 * This value may not be used to build other algorithms that are
 * parametrized over a hash. For any valid use of this macro to build
 * an algorithm \c alg, #IFX_SE_ALG_IS_HASH_AND_SIGN(\c alg) is true.
 *
 * This value may not be used to build an algorithm specification to
 * perform an operation. It is only valid to build policies.
 */
#define IFX_SE_ALG_ANY_HASH                        ((ifx_se_algorithm_t)0x020000ff)

/** \cond INTERNAL */
#define IFX_SE_ALG_MAC_SUBCATEGORY_MASK            ((ifx_se_algorithm_t)0x00c00000)
#define IFX_SE_ALG_HMAC_BASE                       ((ifx_se_algorithm_t)0x03800000)
#define IFX_SE_MAC_TRUNCATION_OFFSET 16
#define IFX_SE_ALG_HMAC_GET_HASH(hmac_alg)                             \
    (IFX_SE_ALG_CATEGORY_HASH | ((hmac_alg) & IFX_SE_ALG_HASH_MASK))
/** \endcond */

/** Macro to build an HMAC algorithm.
 *
 * For example, #IFX_SE_ALG_HMAC(#IFX_SE_ALG_SHA_256) is HMAC-SHA-256.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding HMAC algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_HMAC(hash_alg)                                  \
    (IFX_SE_ALG_HMAC_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is an HMAC algorithm.
 *
 * HMAC is a family of MAC algorithms that are based on a hash function.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is an HMAC algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_HMAC(alg)                                            \
    (((alg) & (IFX_SE_ALG_CATEGORY_MASK | IFX_SE_ALG_MAC_SUBCATEGORY_MASK)) == \
     IFX_SE_ALG_HMAC_BASE)

/** In the encoding of a MAC algorithm, the bits corresponding to
 * IFX_SE_ALG_MAC_TRUNCATION_MASK encode the length to which the MAC is
 * truncated. As an exception, the value 0 means the untruncated algorithm,
 * whatever its length is. The length is encoded in 6 bits, so it can
 * reach up to 63; the largest MAC is 64 bytes so its trivial truncation
 * to full length is correctly encoded as 0 and any non-trivial truncation
 * is correctly encoded as a value between 1 and 63. */
#define IFX_SE_ALG_MAC_TRUNCATION_MASK             ((ifx_se_algorithm_t)0x003f0000)

/** In the encoding of a MAC algorithm, the bit corresponding to
 * #IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG encodes the fact that the algorithm
 * is a wildcard algorithm. A key with such wildcard algorithm as permitted
 * algorithm policy can be used with any algorithm corresponding to the
 * same base class and having a (potentially truncated) MAC length greater or
 * equal than the one encoded in #IFX_SE_ALG_MAC_TRUNCATION_MASK. */
#define IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG   ((ifx_se_algorithm_t)0x00008000)

