PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Macro to build a truncated MAC algorithm.
 *
 * A truncated MAC algorithm is identical to the corresponding MAC
 * algorithm except that the MAC value for the truncated algorithm
 * consists of only the first \p mac_length bytes of the MAC value
 * for the untruncated algorithm.
 *
 * \note    This macro may allow constructing algorithm identifiers that
 *          are not valid, either because the specified length is larger
 *          than the untruncated MAC or because the specified length is
 *          smaller than permitted by the implementation.
 *
 * \note    It is implementation-defined whether a truncated MAC that
 *          is truncated to the same length as the MAC of the untruncated
 *          algorithm is considered identical to the untruncated algorithm
 *          for policy comparison purposes.
 *
 * \param mac_alg       A MAC algorithm identifier (value of type
 *                      #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_MAC(\p mac_alg)
 *                      is true). This may be a truncated or untruncated
 *                      MAC algorithm.
 * \param mac_length    Desired length of the truncated MAC in bytes.
 *                      This must be at most the full length of the MAC
 *                      and must be at least an implementation-specified
 *                      minimum. The implementation-specified minimum
 *                      shall not be zero.
 *
 * \return              The corresponding MAC algorithm with the specified
 *                      length.
 * \return              Unspecified if \p mac_alg is not a supported
 *                      MAC algorithm or if \p mac_length is too small or
 *                      too large for the specified MAC algorithm.
 */
#define IFX_SE_ALG_TRUNCATED_MAC(mac_alg, mac_length)              \
    (((mac_alg) & ~(IFX_SE_ALG_MAC_TRUNCATION_MASK |               \
                    IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG)) |   \
     ((mac_length) << IFX_SE_MAC_TRUNCATION_OFFSET & IFX_SE_ALG_MAC_TRUNCATION_MASK))

/** Macro to build the base MAC algorithm corresponding to a truncated
 * MAC algorithm.
 *
 * \param mac_alg       A MAC algorithm identifier (value of type
 *                      #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_MAC(\p mac_alg)
 *                      is true). This may be a truncated or untruncated
 *                      MAC algorithm.
 *
 * \return              The corresponding base MAC algorithm.
 * \return              Unspecified if \p mac_alg is not a supported
 *                      MAC algorithm.
 */
#define IFX_SE_ALG_FULL_LENGTH_MAC(mac_alg)                        \
    ((mac_alg) & ~(IFX_SE_ALG_MAC_TRUNCATION_MASK |                \
                   IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG))

/** Length to which a MAC algorithm is truncated.
 *
 * \param mac_alg       A MAC algorithm identifier (value of type
 *                      #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_MAC(\p mac_alg)
 *                      is true).
 *
 * \return              Length of the truncated MAC in bytes.
 * \return              0 if \p mac_alg is a non-truncated MAC algorithm.
 * \return              Unspecified if \p mac_alg is not a supported
 *                      MAC algorithm.
 */
#define IFX_SE_MAC_TRUNCATED_LENGTH(mac_alg)                               \
    (((mac_alg) & IFX_SE_ALG_MAC_TRUNCATION_MASK) >> IFX_SE_MAC_TRUNCATION_OFFSET)

/** Macro to build a MAC minimum-MAC-length wildcard algorithm.
 *
 * A minimum-MAC-length MAC wildcard algorithm permits all MAC algorithms
 * sharing the same base algorithm, and where the (potentially truncated) MAC
 * length of the specific algorithm is equal to or larger then the wildcard
 * algorithm's minimum MAC length.
 *
 * \note    When setting the minimum required MAC length to less than the
 *          smallest MAC length allowed by the base algorithm, this effectively
 *          becomes an 'any-MAC-length-allowed' policy for that base algorithm.
 *
 * \param mac_alg         A MAC algorithm identifier (value of type
 *                        #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_MAC(\p mac_alg)
 *                        is true).
 * \param min_mac_length  Desired minimum length of the message authentication
 *                        code in bytes. This must be at most the untruncated
 *                        length of the MAC and must be at least 1.
 *
 * \return                The corresponding MAC wildcard algorithm with the
 *                        specified minimum length.
 * \return                Unspecified if \p mac_alg is not a supported MAC
 *                        algorithm or if \p min_mac_length is less than 1 or
 *                        too large for the specified MAC algorithm.
 */
#define IFX_SE_ALG_AT_LEAST_THIS_LENGTH_MAC(mac_alg, min_mac_length)   \
    ( IFX_SE_ALG_TRUNCATED_MAC(mac_alg, min_mac_length) |              \
      IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG )

/** \cond INTERNAL */
#define IFX_SE_ALG_CIPHER_MAC_BASE                 ((ifx_se_algorithm_t)0x03c00000)
#define IFX_SE_ALG_CIPHER_STREAM_FLAG              ((ifx_se_algorithm_t)0x00800000)
#define IFX_SE_ALG_CIPHER_FROM_BLOCK_FLAG          ((ifx_se_algorithm_t)0x00400000)
/** \endcond */

/** The CBC-MAC construction over a block cipher
 *
 * \warning CBC-MAC is insecure in many cases.
 * A more secure mode, such as #IFX_SE_ALG_CMAC, is recommended.
 */
#define IFX_SE_ALG_CBC_MAC                         ((ifx_se_algorithm_t)0x03c00100)
/** The CMAC construction over a block cipher */
#define IFX_SE_ALG_CMAC                            ((ifx_se_algorithm_t)0x03c00200)

/** Whether the specified algorithm is a MAC algorithm based on a block cipher.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a MAC algorithm based on a block cipher, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_BLOCK_CIPHER_MAC(alg)                                \
    (((alg) & (IFX_SE_ALG_CATEGORY_MASK | IFX_SE_ALG_MAC_SUBCATEGORY_MASK)) == \
     IFX_SE_ALG_CIPHER_MAC_BASE)

/** Whether the specified algorithm is a stream cipher.
 *
 * A stream cipher is a symmetric cipher that encrypts or decrypts messages
 * by applying a bitwise-xor with a stream of bytes that is generated
 * from a key.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a stream cipher algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier or if it is not a symmetric cipher algorithm.
 */
#define IFX_SE_ALG_IS_STREAM_CIPHER(alg)            \
    (((alg) & (IFX_SE_ALG_CATEGORY_MASK | IFX_SE_ALG_CIPHER_STREAM_FLAG)) == \
        (IFX_SE_ALG_CATEGORY_CIPHER | IFX_SE_ALG_CIPHER_STREAM_FLAG))

