PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** The stream cipher mode of a stream cipher algorithm.
 *
 * The underlying stream cipher is determined by the key type.
 * - To use ChaCha20, use a key type of #IFX_SE_KEY_TYPE_CHACHA20.
 */
#define IFX_SE_ALG_STREAM_CIPHER                   ((ifx_se_algorithm_t)0x04800100)

/** The CTR stream cipher mode.
 *
 * CTR is a stream cipher which is built from a block cipher.
 * The underlying block cipher is determined by the key type.
 * For example, to use AES-128-CTR, use this algorithm with
 * a key of type #IFX_SE_KEY_TYPE_AES and a length of 128 bits (16 bytes).
 */
#define IFX_SE_ALG_CTR                             ((ifx_se_algorithm_t)0x04c01000)

/** The CFB stream cipher mode.
 *
 * The underlying block cipher is determined by the key type.
 */
#define IFX_SE_ALG_CFB                             ((ifx_se_algorithm_t)0x04c01100)

/** The OFB stream cipher mode.
 *
 * The underlying block cipher is determined by the key type.
 */
#define IFX_SE_ALG_OFB                             ((ifx_se_algorithm_t)0x04c01200)

/** The XTS cipher mode.
 *
 * XTS is a cipher mode which is built from a block cipher. It requires at
 * least one full block of input, but beyond this minimum the input
 * does not need to be a whole number of blocks.
 */
#define IFX_SE_ALG_XTS                             ((ifx_se_algorithm_t)0x0440ff00)

/** The Electronic Code Book (ECB) mode of a block cipher, with no padding.
 *
 * \warning ECB mode does not protect the confidentiality of the encrypted data
 * except in extremely narrow circumstances. It is recommended that applications
 * only use ECB if they need to construct an operating mode that the
 * implementation does not provide. Implementations are encouraged to provide
 * the modes that applications need in preference to supporting direct access
 * to ECB.
 *
 * The underlying block cipher is determined by the key type.
 *
 * This symmetric cipher mode can only be used with messages whose lengths are a
 * multiple of the block size of the chosen block cipher.
 *
 * ECB mode does not accept an initialization vector (IV). When using a
 * multi-part cipher operation with this algorithm, ifx_se_cipher_generate_iv()
 * and ifx_se_cipher_set_iv() must not be called.
 */
#define IFX_SE_ALG_ECB_NO_PADDING                  ((ifx_se_algorithm_t)0x04404400)

/** The CBC block cipher chaining mode, with no padding.
 *
 * The underlying block cipher is determined by the key type.
 *
 * This symmetric cipher mode can only be used with messages whose lengths
 * are whole number of blocks for the chosen block cipher.
 */
#define IFX_SE_ALG_CBC_NO_PADDING                  ((ifx_se_algorithm_t)0x04404000)

/** The CBC block cipher chaining mode with PKCS#7 padding.
 *
 * The underlying block cipher is determined by the key type.
 *
 * This is the padding method defined by PKCS#7 (RFC 2315) &sect;10.3.
 */
#define IFX_SE_ALG_CBC_PKCS7                       ((ifx_se_algorithm_t)0x04404100)

/** \cond INTERNAL */
#define IFX_SE_AEAD_TAG_LENGTH_OFFSET 16
#define IFX_SE_ALG_AEAD_FROM_BLOCK_FLAG            ((ifx_se_algorithm_t)0x00400000)
/** \endcond */

/** Whether the specified algorithm is an AEAD mode on a block cipher.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is an AEAD algorithm which is an AEAD mode based on
 *         a block cipher, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_AEAD_ON_BLOCK_CIPHER(alg)    \
    (((alg) & (IFX_SE_ALG_CATEGORY_MASK | IFX_SE_ALG_AEAD_FROM_BLOCK_FLAG)) == \
     (IFX_SE_ALG_CATEGORY_AEAD | IFX_SE_ALG_AEAD_FROM_BLOCK_FLAG))

/** The CCM authenticated encryption algorithm.
 *
 * The underlying block cipher is determined by the key type.
 */
#define IFX_SE_ALG_CCM                             ((ifx_se_algorithm_t)0x05500100)

/** The CCM* cipher mode without authentication.
 *
 * This is CCM* as specified in IEEE 802.15.4 #7, with a tag length of 0.
 * For CCM* with a nonzero tag length, use the AEAD algorithm #IFX_SE_ALG_CCM.
 *
 * The underlying block cipher is determined by the key type.
 *
 * Currently only 13-byte long IV's are supported.
 */
#define IFX_SE_ALG_CCM_STAR_NO_TAG                 ((ifx_se_algorithm_t)0x04c01300)

/** The GCM authenticated encryption algorithm.
 *
 * The underlying block cipher is determined by the key type.
 */
#define IFX_SE_ALG_GCM                             ((ifx_se_algorithm_t)0x05500200)

/** The Chacha20-Poly1305 AEAD algorithm.
 *
 * The ChaCha20_Poly1305 construction is defined in RFC 7539.
 *
 * Implementations must support 12-byte nonces, may support 8-byte nonces,
 * and should reject other sizes.
 *
 * Implementations must support 16-byte tags and should reject other sizes.
 */
#define IFX_SE_ALG_CHACHA20_POLY1305               ((ifx_se_algorithm_t)0x05100500)

/** In the encoding of an AEAD algorithm, the bits corresponding to
 * IFX_SE_ALG_AEAD_TAG_LENGTH_MASK encode the length of the AEAD tag.
 * The constants for default lengths follow this encoding.
 */
#define IFX_SE_ALG_AEAD_TAG_LENGTH_MASK            ((ifx_se_algorithm_t)0x003f0000)

/** In the encoding of an AEAD algorithm, the bit corresponding to
 * #IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG encodes the fact that the algorithm
 * is a wildcard algorithm. A key with such wildcard algorithm as permitted
 * algorithm policy can be used with any algorithm corresponding to the
 * same base class and having a tag length greater than or equal to the one
 * encoded in #IFX_SE_ALG_AEAD_TAG_LENGTH_MASK. */
#define IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG  ((ifx_se_algorithm_t)0x00008000)

/** Macro to build a shortened AEAD algorithm.
 *
 * A shortened AEAD algorithm is similar to the corresponding AEAD
 * algorithm, but has an authentication tag that consists of fewer bytes.
 * Depending on the algorithm, the tag length may affect the calculation
 * of the ciphertext.
 *
 * \param aead_alg      An AEAD algorithm identifier (value of type
 *                      #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_AEAD(\p aead_alg)
 *                      is true).
 * \param tag_length    Desired length of the authentication tag in bytes.
 *
 * \return              The corresponding AEAD algorithm with the specified
 *                      length.
 * \return              Unspecified if \p aead_alg is not a supported
 *                      AEAD algorithm or if \p tag_length is not valid
 *                      for the specified AEAD algorithm.
 */
#define IFX_SE_ALG_AEAD_WITH_SHORTENED_TAG(aead_alg, tag_length)           \
    (((aead_alg) & ~(IFX_SE_ALG_AEAD_TAG_LENGTH_MASK |                     \
                     IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG)) |         \
     ((tag_length) << IFX_SE_AEAD_TAG_LENGTH_OFFSET &                      \
      IFX_SE_ALG_AEAD_TAG_LENGTH_MASK))

/** Retrieve the tag length of a specified AEAD algorithm
 *
 * \param aead_alg      An AEAD algorithm identifier (value of type
 *                      #ifx_se_algorithm_t such that #IFX_SE_ALG_IS_AEAD(\p aead_alg)
 *                      is true).
 *
 * \return              The tag length specified by the input algorithm.
 * \return              Unspecified if \p aead_alg is not a supported
 *                      AEAD algorithm.
 */
#define IFX_SE_ALG_AEAD_GET_TAG_LENGTH(aead_alg)                           \
    (((aead_alg) & IFX_SE_ALG_AEAD_TAG_LENGTH_MASK) >>                     \
      IFX_SE_AEAD_TAG_LENGTH_OFFSET )

/** Calculate the corresponding AEAD algorithm with the default tag length.
 *
 * \param aead_alg      An AEAD algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_AEAD(\p aead_alg) is true).
 *
 * \return              The corresponding AEAD algorithm with the default
 *                      tag length for that algorithm.
 */
#define IFX_SE_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG(aead_alg)                   \
    (                                                                    \
        IFX_SE_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG_CASE(aead_alg, IFX_SE_ALG_CCM) \
        IFX_SE_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG_CASE(aead_alg, IFX_SE_ALG_GCM) \
        IFX_SE_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG_CASE(aead_alg, IFX_SE_ALG_CHACHA20_POLY1305) \
        0)

/** \cond INTERNAL */
#define IFX_SE_ALG_AEAD_WITH_DEFAULT_LENGTH_TAG_CASE(aead_alg, ref)         \
    IFX_SE_ALG_AEAD_WITH_SHORTENED_TAG(aead_alg, 0) ==                      \
    IFX_SE_ALG_AEAD_WITH_SHORTENED_TAG(ref, 0) ?                            \
    ref :
/** \endcond */

/** Macro to build an AEAD minimum-tag-length wildcard algorithm.
 *
 * A minimum-tag-length AEAD wildcard algorithm permits all AEAD algorithms
 * sharing the same base algorithm, and where the tag length of the specific
 * algorithm is equal to or larger then the minimum tag length specified by the
 * wildcard algorithm.
 *
 * \note    When setting the minimum required tag length to less than the
 *          smallest tag length allowed by the base algorithm, this effectively
 *          becomes an 'any-tag-length-allowed' policy for that base algorithm.
 *
 * \param aead_alg        An AEAD algorithm identifier (value of type
 *                        #ifx_se_algorithm_t such that
 *                        #IFX_SE_ALG_IS_AEAD(\p aead_alg) is true).
 * \param min_tag_length  Desired minimum length of the authentication tag in
 *                        bytes. This must be at least 1 and at most the largest
 *                        allowed tag length of the algorithm.
 *
 * \return                The corresponding AEAD wildcard algorithm with the
 *                        specified minimum length.
 * \return                Unspecified if \p aead_alg is not a supported
 *                        AEAD algorithm or if \p min_tag_length is less than 1
 *                        or too large for the specified AEAD algorithm.
 */
#define IFX_SE_ALG_AEAD_WITH_AT_LEAST_THIS_LENGTH_TAG(aead_alg, min_tag_length) \
    ( IFX_SE_ALG_AEAD_WITH_SHORTENED_TAG(aead_alg, min_tag_length) |            \
      IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG )

/** \cond INTERNAL */
#define IFX_SE_ALG_RSA_PKCS1V15_SIGN_BASE          ((ifx_se_algorithm_t)0x06000200)
#define IFX_SE_ALG_RSA_PSS_BASE                    ((ifx_se_algorithm_t)0x06000300)
#define IFX_SE_ALG_RSA_PSS_ANY_SALT_BASE           ((ifx_se_algorithm_t)0x06001300)
#define IFX_SE_ALG_IS_RSA_PKCS1V15_SIGN(alg)                               \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_RSA_PKCS1V15_SIGN_BASE)
/** \endcond */

/** RSA PKCS#1 v1.5 signature with hashing.
 *
 * This is the signature scheme defined by RFC 8017
 * (PKCS#1: RSA Cryptography Specifications) under the name
 * RSASSA-PKCS1-v1_5.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *                      This includes #IFX_SE_ALG_ANY_HASH
 *                      when specifying the algorithm in a usage policy.
 *
 * \return              The corresponding RSA PKCS#1 v1.5 signature algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_RSA_PKCS1V15_SIGN(hash_alg)                             \
    (IFX_SE_ALG_RSA_PKCS1V15_SIGN_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

