PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Raw PKCS#1 v1.5 signature.
 *
 * The input to this algorithm is the DigestInfo structure used by
 * RFC 8017 (PKCS#1: RSA Cryptography Specifications), &sect;9.2
 * steps 3&ndash;6.
 */
#define IFX_SE_ALG_RSA_PKCS1V15_SIGN_RAW IFX_SE_ALG_RSA_PKCS1V15_SIGN_BASE

/** RSA PSS signature with hashing.
 *
 * This is the signature scheme defined by RFC 8017
 * (PKCS#1: RSA Cryptography Specifications) under the name
 * RSASSA-PSS, with the message generation function MGF1, and with
 * a salt length equal to the length of the hash. The specified
 * hash algorithm is used to hash the input message, to create the
 * salted hash, and for the mask generation.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *                      This includes #IFX_SE_ALG_ANY_HASH
 *                      when specifying the algorithm in a usage policy.
 *
 * \return              The corresponding RSA PSS signature algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_RSA_PSS(hash_alg)                               \
    (IFX_SE_ALG_RSA_PSS_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** RSA PSS signature with hashing with relaxed verification.
 *
 * This algorithm has the same behavior as #IFX_SE_ALG_RSA_PSS when signing,
 * but allows an arbitrary salt length (including \c 0) when verifying a
 * signature.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *                      This includes #IFX_SE_ALG_ANY_HASH
 *                      when specifying the algorithm in a usage policy.
 *
 * \return              The corresponding RSA PSS signature algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_RSA_PSS_ANY_SALT(hash_alg)                      \
    (IFX_SE_ALG_RSA_PSS_ANY_SALT_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is RSA PSS with standard salt.
 *
 * \param alg           An algorithm value or an algorithm policy wildcard.
 *
 * \return              1 if \p alg is of the form
 *                      #IFX_SE_ALG_RSA_PSS(\c hash_alg),
 *                      where \c hash_alg is a hash algorithm or
 *                      #IFX_SE_ALG_ANY_HASH. 0 otherwise.
 *                      This macro may return either 0 or 1 if \p alg is not
 *                      a supported algorithm identifier or policy.
 */
#define IFX_SE_ALG_IS_RSA_PSS_STANDARD_SALT(alg)                   \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_RSA_PSS_BASE)

/** Whether the specified algorithm is RSA PSS with any salt.
 *
 * \param alg           An algorithm value or an algorithm policy wildcard.
 *
 * \return              1 if \p alg is of the form
 *                      IFX_SE_ALG_RSA_PSS_ANY_SALT_BASE(\c hash_alg),
 *                      where \c hash_alg is a hash algorithm or
 *                      #IFX_SE_ALG_ANY_HASH. 0 otherwise.
 *                      This macro may return either 0 or 1 if \p alg is not
 *                      a supported algorithm identifier or policy.
 */
#define IFX_SE_ALG_IS_RSA_PSS_ANY_SALT(alg)                                \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_RSA_PSS_ANY_SALT_BASE)

/** Whether the specified algorithm is RSA PSS.
 *
 * This includes any of the RSA PSS algorithm variants, regardless of the
 * constraints on salt length.
 *
 * \param alg           An algorithm value or an algorithm policy wildcard.
 *
 * \return              1 if \p alg is of the form
 *                      #IFX_SE_ALG_RSA_PSS(\c hash_alg) or
 *                      IFX_SE_ALG_RSA_PSS_ANY_SALT_BASE(\c hash_alg),
 *                      where \c hash_alg is a hash algorithm or
 *                      #IFX_SE_ALG_ANY_HASH. 0 otherwise.
 *                      This macro may return either 0 or 1 if \p alg is not
 *                      a supported algorithm identifier or policy.
 */
#define IFX_SE_ALG_IS_RSA_PSS(alg)                                 \
    (IFX_SE_ALG_IS_RSA_PSS_STANDARD_SALT(alg) ||                   \
     IFX_SE_ALG_IS_RSA_PSS_ANY_SALT(alg))

/** \cond INTERNAL */
#define IFX_SE_ALG_ECDSA_BASE                      ((ifx_se_algorithm_t)0x06000600)
#define IFX_SE_ALG_DETERMINISTIC_ECDSA_BASE        ((ifx_se_algorithm_t)0x06000700)
/** \endcond */

/** ECDSA signature with hashing.
 *
 * This is the ECDSA signature scheme defined by ANSI X9.62,
 * with a random per-message secret number (*k*).
 *
 * The representation of the signature as a byte string consists of
 * the concatenation of the signature values *r* and *s*. Each of
 * *r* and *s* is encoded as an *N*-octet string, where *N* is the length
 * of the base point of the curve in octets. Each value is represented
 * in big-endian order (most significant octet first).
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *                      This includes #IFX_SE_ALG_ANY_HASH
 *                      when specifying the algorithm in a usage policy.
 *
 * \return              The corresponding ECDSA signature algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_ECDSA(hash_alg)                                 \
    (IFX_SE_ALG_ECDSA_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))
/** ECDSA signature without hashing.
 *
 * This is the same signature scheme as #IFX_SE_ALG_ECDSA(), but
 * without specifying a hash algorithm. This algorithm may only be
 * used to sign or verify a sequence of bytes that should be an
 * already-calculated hash. Note that the input is padded with
 * zeros on the left or truncated on the left as required to fit
 * the curve size.
 */
#define IFX_SE_ALG_ECDSA_ANY IFX_SE_ALG_ECDSA_BASE

/** Deterministic ECDSA signature with hashing.
 *
 * This is the deterministic ECDSA signature scheme defined by RFC 6979.
 *
 * The representation of a signature is the same as with #IFX_SE_ALG_ECDSA().
 *
 * Note that when this algorithm is used for verification, signatures
 * made with randomized ECDSA (#IFX_SE_ALG_ECDSA(\p hash_alg)) with the
 * same private key are accepted. In other words,
 * #IFX_SE_ALG_DETERMINISTIC_ECDSA(\p hash_alg) differs from
 * #IFX_SE_ALG_ECDSA(\p hash_alg) only for signature, not for verification.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *                      This includes #IFX_SE_ALG_ANY_HASH
 *                      when specifying the algorithm in a usage policy.
 *
 * \return              The corresponding deterministic ECDSA signature
 *                      algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_DETERMINISTIC_ECDSA(hash_alg)                           \
    (IFX_SE_ALG_DETERMINISTIC_ECDSA_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** \cond INTERNAL */
#define IFX_SE_ALG_ECDSA_DETERMINISTIC_FLAG        ((ifx_se_algorithm_t)0x00000100)
#define IFX_SE_ALG_IS_ECDSA(alg)                                           \
    (((alg) & ~IFX_SE_ALG_HASH_MASK & ~IFX_SE_ALG_ECDSA_DETERMINISTIC_FLAG) ==  \
     IFX_SE_ALG_ECDSA_BASE)
#define IFX_SE_ALG_ECDSA_IS_DETERMINISTIC(alg)             \
    (((alg) & IFX_SE_ALG_ECDSA_DETERMINISTIC_FLAG) != 0)
#define IFX_SE_ALG_IS_DETERMINISTIC_ECDSA(alg)                             \
    (IFX_SE_ALG_IS_ECDSA(alg) && IFX_SE_ALG_ECDSA_IS_DETERMINISTIC(alg))
#define IFX_SE_ALG_IS_RANDOMIZED_ECDSA(alg)                                \
    (IFX_SE_ALG_IS_ECDSA(alg) && !IFX_SE_ALG_ECDSA_IS_DETERMINISTIC(alg))
/** \endcond */

/** Edwards-curve digital signature algorithm without prehashing (PureEdDSA),
 * using standard parameters.
 *
 * Contexts are not supported in the current version of this specification
 * because there is no suitable signature interface that can take the
 * context as a parameter. A future version of this specification may add
 * suitable functions and extend this algorithm to support contexts.
 *
 * PureEdDSA requires an elliptic curve key on a twisted Edwards curve.
 * In this specification, the following curves are supported:
 * - #IFX_SE_ECC_FAMILY_TWISTED_EDWARDS, 255-bit: Ed25519 as specified
 *   in RFC 8032.
 *   The curve is Edwards25519.
 *   The hash function used internally is SHA-512.
 * - #IFX_SE_ECC_FAMILY_TWISTED_EDWARDS, 448-bit: Ed448 as specified
 *   in RFC 8032.
 *   The curve is Edwards448.
 *   The hash function used internally is the first 114 bytes of the
 *   SHAKE256 output.
 *
 * This algorithm can be used with ifx_se_sign_message() and
 * ifx_se_verify_message(). Since there is no prehashing, it cannot be used
 * with ifx_se_sign_hash() or ifx_se_verify_hash().
 *
 * The signature format is the concatenation of R and S as defined by
 * RFC 8032 #5.1.6 and #5.2.6 (a 64-byte string for Ed25519, a 114-byte
 * string for Ed448).
 */
#define IFX_SE_ALG_PURE_EDDSA                      ((ifx_se_algorithm_t)0x06000800)

/** \cond INTERNAL */
#define IFX_SE_ALG_HASH_EDDSA_BASE                 ((ifx_se_algorithm_t)0x06000900)
#define IFX_SE_ALG_IS_HASH_EDDSA(alg)              \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HASH_EDDSA_BASE)
/** \endcond */

/** Edwards-curve digital signature algorithm with prehashing (HashEdDSA),
 * using SHA-512 and the Edwards25519 curve.
 *
 * See #IFX_SE_ALG_PURE_EDDSA regarding context support and the signature format.
 *
 * This algorithm is Ed25519 as specified in RFC 8032.
 * The curve is Edwards25519.
 * The prehash is SHA-512.
 * The hash function used internally is SHA-512.
 *
 * This is a hash-and-sign algorithm: to calculate a signature,
 * you can either:
 * - call ifx_se_sign_message() on the message;
 * - or calculate the SHA-512 hash of the message
 *   with ifx_se_hash_compute()
 *   or with a multi-part hash operation started with ifx_se_hash_setup(),
 *   using the hash algorithm #IFX_SE_ALG_SHA_512,
 *   then sign the calculated hash with ifx_se_sign_hash().
 * Verifying a signature is similar, using ifx_se_verify_message() or
 * ifx_se_verify_hash() instead of the signature function.
 */
#define IFX_SE_ALG_ED25519PH                               \
    (IFX_SE_ALG_HASH_EDDSA_BASE | (IFX_SE_ALG_SHA_512 & IFX_SE_ALG_HASH_MASK))

/** Edwards-curve digital signature algorithm with prehashing (HashEdDSA),
 * using SHAKE256 and the Edwards448 curve.
 *
 * See #IFX_SE_ALG_PURE_EDDSA regarding context support and the signature format.
 *
 * This algorithm is Ed448 as specified in RFC 8032.
 * The curve is Edwards448.
 * The prehash is the first 64 bytes of the SHAKE256 output.
 * The hash function used internally is the first 114 bytes of the
 * SHAKE256 output.
 *
 * This is a hash-and-sign algorithm: to calculate a signature,
 * you can either:
 * - call ifx_se_sign_message() on the message;
 * - or calculate the first 64 bytes of the SHAKE256 output of the message
 *   with ifx_se_hash_compute()
 *   or with a multi-part hash operation started with ifx_se_hash_setup(),
 *   using the hash algorithm #IFX_SE_ALG_SHAKE256_512,
 *   then sign the calculated hash with ifx_se_sign_hash().
 * Verifying a signature is similar, using ifx_se_verify_message() or
 * ifx_se_verify_hash() instead of the signature function.
 */
#define IFX_SE_ALG_ED448PH                                 \
    (IFX_SE_ALG_HASH_EDDSA_BASE | (IFX_SE_ALG_SHAKE256_512 & IFX_SE_ALG_HASH_MASK))

/** Default definition, to be overridden if the library is extended with
 * more hash-and-sign algorithms that we want to keep out of this header
 * file. */
#define IFX_SE_ALG_IS_VENDOR_HASH_AND_SIGN(alg) 0

/** Whether the specified algorithm is a signature algorithm that can be used
 * with ifx_se_sign_hash() and ifx_se_verify_hash().
 *
 * This encompasses all strict hash-and-sign algorithms categorized by
 * IFX_SE_ALG_IS_HASH_AND_SIGN(), as well as algorithms that follow the
 * paradigm more loosely:
 * - #IFX_SE_ALG_RSA_PKCS1V15_SIGN_RAW (expects its input to be an encoded hash)
 * - #IFX_SE_ALG_ECDSA_ANY (doesn't specify what kind of hash the input is)
 *
 * \param alg An algorithm identifier (value of type ifx_se_algorithm_t).
 *
 * \return 1 if alg is a signature algorithm that can be used to sign a
 *         hash. 0 if alg is a signature algorithm that can only be used
 *         to sign a message. 0 if alg is not a signature algorithm.
 *         This macro can return either 0 or 1 if alg is not a
 *         supported algorithm identifier.
 */
#define IFX_SE_ALG_IS_SIGN_HASH(alg)                                       \
    (IFX_SE_ALG_IS_RSA_PSS(alg) || IFX_SE_ALG_IS_RSA_PKCS1V15_SIGN(alg) ||    \
     IFX_SE_ALG_IS_ECDSA(alg) || IFX_SE_ALG_IS_HASH_EDDSA(alg) ||             \
     IFX_SE_ALG_IS_VENDOR_HASH_AND_SIGN(alg))

/** Whether the specified algorithm is a signature algorithm that can be used
 * with ifx_se_sign_message() and ifx_se_verify_message().
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if alg is a signature algorithm that can be used to sign a
 *         message. 0 if \p alg is a signature algorithm that can only be used
 *         to sign an already-calculated hash. 0 if \p alg is not a signature
 *         algorithm. This macro can return either 0 or 1 if \p alg is not a
 *         supported algorithm identifier.
 */
#define IFX_SE_ALG_IS_SIGN_MESSAGE(alg)                                    \
    (IFX_SE_ALG_IS_SIGN_HASH(alg) || (alg) == IFX_SE_ALG_PURE_EDDSA )

/** Whether the specified algorithm is a hash-and-sign algorithm.
 *
 * Hash-and-sign algorithms are asymmetric (public-key) signature algorithms
 * structured in two parts: first the calculation of a hash in a way that
 * does not depend on the key, then the calculation of a signature from the
 * hash value and the key. Hash-and-sign algorithms encode the hash
 * used for the hashing step, and you can call #IFX_SE_ALG_SIGN_GET_HASH
 * to extract this algorithm.
 *
 * Thus, for a hash-and-sign algorithm,
 * `ifx_se_sign_message(key, alg, input, ...)` is equivalent to
 * ```
 * ifx_se_hash_compute(IFX_SE_ALG_SIGN_GET_HASH(alg), input, ..., hash, ...);
 * ifx_se_sign_hash(key, alg, hash, ..., signature, ...);
 * ```
 * Most usefully, separating the hash from the signature allows the hash
 * to be calculated in multiple steps with ifx_se_hash_setup(), ifx_se_hash_update()
 * and ifx_se_hash_finish(). Likewise ifx_se_verify_message() is equivalent to
 * calculating the hash and then calling ifx_se_verify_hash().
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a hash-and-sign algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_HASH_AND_SIGN(alg)                                   \
    (IFX_SE_ALG_IS_SIGN_HASH(alg) &&                                       \
     ((alg) & IFX_SE_ALG_HASH_MASK) != 0)

/** Get the hash used by a hash-and-sign signature algorithm.
 *
 * A hash-and-sign algorithm is a signature algorithm which is
 * composed of two phases: first a hashing phase which does not use
 * the key and produces a hash of the input message, then a signing
 * phase which only uses the hash and the key and not the message
 * itself.
 *
 * \param alg   A signature algorithm (\c IFX_SE_ALG_XXX value such that
 *              #IFX_SE_ALG_IS_SIGN(\p alg) is true).
 *
 * \return      The underlying hash algorithm if \p alg is a hash-and-sign
 *              algorithm.
 * \return      0 if \p alg is a signature algorithm that does not
 *              follow the hash-and-sign structure.
 * \return      Unspecified if \p alg is not a signature algorithm or
 *              if it is not supported by the implementation.
 */
#define IFX_SE_ALG_SIGN_GET_HASH(alg)                                     \
    (IFX_SE_ALG_IS_HASH_AND_SIGN(alg) ?                                   \
     ((alg) & IFX_SE_ALG_HASH_MASK) | IFX_SE_ALG_CATEGORY_HASH :             \
     0)

/** RSA PKCS#1 v1.5 encryption.
 */
#define IFX_SE_ALG_RSA_PKCS1V15_CRYPT              ((ifx_se_algorithm_t)0x07000200)

/** RSA OAEP encryption.
 *
 * This is the encryption scheme defined by RFC 8017
 * (PKCS#1: RSA Cryptography Specifications) under the name
 * RSAES-OAEP, with the message generation function MGF1.
 *
 * \param hash_alg      The hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true) to use
 *                      for MGF1.
 *
 * \return              The corresponding RSA OAEP encryption algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_RSA_OAEP(hash_alg)                              \
    (IFX_SE_ALG_RSA_OAEP_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** \cond INTERNAL */
#define IFX_SE_ALG_RSA_OAEP_BASE                   ((ifx_se_algorithm_t)0x07000300)
#define IFX_SE_ALG_IS_RSA_OAEP(alg)                                \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_RSA_OAEP_BASE)
#define IFX_SE_ALG_RSA_OAEP_GET_HASH(alg)                          \
    (IFX_SE_ALG_IS_RSA_OAEP(alg) ?                                 \
     ((alg) & IFX_SE_ALG_HASH_MASK) | IFX_SE_ALG_CATEGORY_HASH :      \
     0)

