PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
#define IFX_SE_ALG_HKDF_BASE                       ((ifx_se_algorithm_t)0x08000100)
/** \endcond */

/** Macro to build an HKDF algorithm.
 *
 * For example, `IFX_SE_ALG_HKDF(IFX_SE_ALG_SHA256)` is HKDF using HMAC-SHA-256.
 *
 * This key derivation algorithm uses the following inputs:
 * - #IFX_SE_KEY_DERIVATION_INPUT_SALT is the salt used in the "extract" step.
 *   It is optional; if omitted, the derivation uses an empty salt.
 * - #IFX_SE_KEY_DERIVATION_INPUT_SECRET is the secret key used in the "extract" step.
 * - #IFX_SE_KEY_DERIVATION_INPUT_INFO is the info string used in the "expand" step.
 * You must pass #IFX_SE_KEY_DERIVATION_INPUT_SALT before #IFX_SE_KEY_DERIVATION_INPUT_SECRET.
 * You may pass #IFX_SE_KEY_DERIVATION_INPUT_INFO at any time after setup and before
 * starting to generate output.
 *
 *  \warning  HKDF processes the salt as follows: first hash it with hash_alg
 *  if the salt is longer than the block size of the hash algorithm; then
 *  pad with null bytes up to the block size. As a result, it is possible
 *  for distinct salt inputs to result in the same outputs. To ensure
 *  unique outputs, it is recommended to use a fixed length for salt values.
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding HKDF algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_HKDF(hash_alg)                                  \
    (IFX_SE_ALG_HKDF_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))
/** Whether the specified algorithm is an HKDF algorithm.
 *
 * HKDF is a family of key derivation algorithms that are based on a hash
 * function and the HMAC construction.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is an HKDF algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_HKDF(alg)                            \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_BASE)

/** \cond INTERNAL */
#define IFX_SE_ALG_HKDF_GET_HASH(hkdf_alg)                         \
    (IFX_SE_ALG_CATEGORY_HASH | ((hkdf_alg) & IFX_SE_ALG_HASH_MASK))

#define IFX_SE_ALG_HKDF_EXTRACT_BASE                       ((ifx_se_algorithm_t)0x08000400)
/** \endcond */

/** Macro to build an HKDF-Extract algorithm.
 *
 * For example, `IFX_SE_ALG_HKDF_EXTRACT(IFX_SE_ALG_SHA256)` is
 * HKDF-Extract using HMAC-SHA-256.
 *
 * This key derivation algorithm uses the following inputs:
 *  - IFX_SE_KEY_DERIVATION_INPUT_SALT is the salt.
 *  - IFX_SE_KEY_DERIVATION_INPUT_SECRET is the input keying material used in the
 *    "extract" step.
 * The inputs are mandatory and must be passed in the order above.
 * Each input may only be passed once.
 *
 *  \warning HKDF-Extract is not meant to be used on its own. IFX_SE_ALG_HKDF
 *  should be used instead if possible. IFX_SE_ALG_HKDF_EXTRACT is provided
 *  as a separate algorithm for the sake of protocols that use it as a
 *  building block. It may also be a slight performance optimization
 *  in applications that use HKDF with the same salt and key but many
 *  different info strings.
 *
 *  \warning  HKDF processes the salt as follows: first hash it with hash_alg
 *  if the salt is longer than the block size of the hash algorithm; then
 *  pad with null bytes up to the block size. As a result, it is possible
 *  for distinct salt inputs to result in the same outputs. To ensure
 *  unique outputs, it is recommended to use a fixed length for salt values.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding HKDF-Extract algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_HKDF_EXTRACT(hash_alg)                                  \
    (IFX_SE_ALG_HKDF_EXTRACT_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))
/** Whether the specified algorithm is an HKDF-Extract algorithm.
 *
 * HKDF-Extract is a family of key derivation algorithms that are based
 * on a hash function and the HMAC construction.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is an HKDF-Extract algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_HKDF_EXTRACT(alg)                            \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_EXTRACT_BASE)

/** \cond INTERNAL */
#define IFX_SE_ALG_HKDF_EXPAND_BASE                       ((ifx_se_algorithm_t)0x08000500)
/** \endcond */

/** Macro to build an HKDF-Expand algorithm.
 *
 * For example, `IFX_SE_ALG_HKDF_EXPAND(IFX_SE_ALG_SHA256)` is
 * HKDF-Expand using HMAC-SHA-256.
 *
 * This key derivation algorithm uses the following inputs:
 *  - IFX_SE_KEY_DERIVATION_INPUT_SECRET is the pseudorandom key (PRK).
 *  - IFX_SE_KEY_DERIVATION_INPUT_INFO is the info string.
 *
 *  The inputs are mandatory and must be passed in the order above.
 *  Each input may only be passed once.
 *
 *  \warning HKDF-Expand is not meant to be used on its own. `IFX_SE_ALG_HKDF`
 *  should be used instead if possible. `IFX_SE_ALG_HKDF_EXPAND` is provided as
 *  a separate algorithm for the sake of protocols that use it as a building
 *  block. It may also be a slight performance optimization in applications
 *  that use HKDF with the same salt and key but many different info strings.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding HKDF-Expand algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_HKDF_EXPAND(hash_alg)                                  \
    (IFX_SE_ALG_HKDF_EXPAND_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is an HKDF-Expand algorithm.
 *
 * HKDF-Expand is a family of key derivation algorithms that are based
 * on a hash function and the HMAC construction.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is an HKDF-Expand algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_HKDF_EXPAND(alg)                            \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_EXPAND_BASE)

