PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Whether the specified algorithm is an HKDF or HKDF-Extract or
 *  HKDF-Expand algorithm.
 *
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is any HKDF type algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_ANY_HKDF(alg)                                   \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_BASE ||          \
     ((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_EXTRACT_BASE ||  \
     ((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_HKDF_EXPAND_BASE)

/** Macro to build a TLS-1.2 PRF algorithm.
 *
 * TLS 1.2 uses a custom pseudorandom function (PRF) for key schedule,
 * specified in Section 5 of RFC 5246. It is based on HMAC and can be
 * used with either SHA-256 or SHA-384.
 *
 * This key derivation algorithm uses the following inputs, which must be
 * passed in the order given here:
 * - #IFX_SE_KEY_DERIVATION_INPUT_SEED is the seed.
 * - #IFX_SE_KEY_DERIVATION_INPUT_SECRET is the secret key.
 * - #IFX_SE_KEY_DERIVATION_INPUT_LABEL is the label.
 *
 * For the application to TLS-1.2 key expansion, the seed is the
 * concatenation of ServerHello.Random + ClientHello.Random,
 * and the label is "key expansion".
 *
 * For example, `IFX_SE_ALG_TLS12_PRF(IFX_SE_ALG_SHA256)` represents the
 * TLS 1.2 PRF using HMAC-SHA-256.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding TLS-1.2 PRF algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_TLS12_PRF(hash_alg)                                  \
    (IFX_SE_ALG_TLS12_PRF_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is a TLS-1.2 PRF algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is a TLS-1.2 PRF algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_TLS12_PRF(alg)                                    \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_TLS12_PRF_BASE)

/** \cond INTERNAL */
#define IFX_SE_ALG_TLS12_PRF_BASE                  ((ifx_se_algorithm_t)0x08000200)
#define IFX_SE_ALG_TLS12_PRF_GET_HASH(hkdf_alg)                         \
    (IFX_SE_ALG_CATEGORY_HASH | ((hkdf_alg) & IFX_SE_ALG_HASH_MASK))
/** \endcond */

/** Macro to build a TLS-1.2 PSK-to-MasterSecret algorithm.
 *
 * In a pure-PSK handshake in TLS 1.2, the master secret is derived
 * from the PreSharedKey (PSK) through the application of padding
 * (RFC 4279, Section 2) and the TLS-1.2 PRF (RFC 5246, Section 5).
 * The latter is based on HMAC and can be used with either SHA-256
 * or SHA-384.
 *
 * This key derivation algorithm uses the following inputs, which must be
 * passed in the order given here:
 * - #IFX_SE_KEY_DERIVATION_INPUT_SEED is the seed.
 * - #IFX_SE_KEY_DERIVATION_INPUT_OTHER_SECRET is the other secret for the
 *   computation of the premaster secret. This input is optional;
 *   if omitted, it defaults to a string of null bytes with the same length
 *   as the secret (PSK) input.
 * - #IFX_SE_KEY_DERIVATION_INPUT_SECRET is the secret key.
 * - #IFX_SE_KEY_DERIVATION_INPUT_LABEL is the label.
 *
 * For the application to TLS-1.2, the seed (which is
 * forwarded to the TLS-1.2 PRF) is the concatenation of the
 * ClientHello.Random + ServerHello.Random,
 * the label is "master secret" or "extended master secret" and
 * the other secret depends on the key exchange specified in the cipher suite:
 * - for a plain PSK cipher suite (RFC 4279, Section 2), omit
 *   IFX_SE_KEY_DERIVATION_INPUT_OTHER_SECRET
 * - for a DHE-PSK (RFC 4279, Section 3) or ECDHE-PSK cipher suite
 *   (RFC 5489, Section 2), the other secret should be the output of the
 *   IFX_SE_ALG_FFDH or IFX_SE_ALG_ECDH key agreement performed with the peer.
 *   The recommended way to pass this input is to use a key derivation
 *   algorithm constructed as
 *   IFX_SE_ALG_KEY_AGREEMENT(ka_alg, IFX_SE_ALG_TLS12_PSK_TO_MS(hash_alg))
 *   and to call ifx_se_key_derivation_key_agreement(). Alternatively,
 *   this input may be an output of `ifx_se_raw_key_agreement()` passed with
 *   ifx_se_key_derivation_input_bytes(), or an equivalent input passed with
 *   ifx_se_key_derivation_input_bytes() or ifx_se_key_derivation_input_key().
 * - for a RSA-PSK cipher suite (RFC 4279, Section 4), the other secret
 *   should be the 48-byte client challenge (the PreMasterSecret of
 *   (RFC 5246, Section 7.4.7.1)) concatenation of the TLS version and
 *   a 46-byte random string chosen by the client. On the server, this is
 *   typically an output of ifx_se_asymmetric_decrypt() using
 *   IFX_SE_ALG_RSA_PKCS1V15_CRYPT, passed to the key derivation operation
 *   with `ifx_se_key_derivation_input_bytes()`.
 *
 * For example, `IFX_SE_ALG_TLS12_PSK_TO_MS(IFX_SE_ALG_SHA256)` represents the
 * TLS-1.2 PSK to MasterSecret derivation PRF using HMAC-SHA-256.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding TLS-1.2 PSK to MS algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_TLS12_PSK_TO_MS(hash_alg)                                  \
    (IFX_SE_ALG_TLS12_PSK_TO_MS_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is a TLS-1.2 PSK to MS algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is a TLS-1.2 PSK to MS algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_TLS12_PSK_TO_MS(alg)                                    \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_TLS12_PSK_TO_MS_BASE)

/** \cond INTERNAL */
#define IFX_SE_ALG_TLS12_PSK_TO_MS_BASE            ((ifx_se_algorithm_t)0x08000300)
#define IFX_SE_ALG_TLS12_PSK_TO_MS_GET_HASH(hkdf_alg)                         \
    (IFX_SE_ALG_CATEGORY_HASH | ((hkdf_alg) & IFX_SE_ALG_HASH_MASK))
/** \endcond */

/** This flag indicates whether the key derivation algorithm is suitable for
 * use on low-entropy secrets such as password - these algorithms are also
 * known as key stretching or password hashing schemes. These are also the
 * algorithms that accepts inputs of type #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD.
 *
 * Those algorithms cannot be combined with a key agreement algorithm.
 */
#define IFX_SE_ALG_KEY_DERIVATION_STRETCHING_FLAG  ((ifx_se_algorithm_t)0x00800000)

/** \cond INTERNAL */
#define IFX_SE_ALG_PBKDF2_HMAC_BASE                ((ifx_se_algorithm_t)0x08800100)
/** \endcond */

/** Macro to build a PBKDF2-HMAC password hashing / key stretching algorithm.
 *
 * PBKDF2 is defined by PKCS#5, republished as RFC 8018 (section 5.2).
 * This macro specifies the PBKDF2 algorithm constructed using a PRF based on
 * HMAC with the specified hash.
 * For example, `IFX_SE_ALG_PBKDF2_HMAC(IFX_SE_ALG_SHA256)` specifies PBKDF2
 * using the PRF HMAC-SHA-256.
 *
 * This key derivation algorithm uses the following inputs, which must be
 * provided in the following order:
 * - #IFX_SE_KEY_DERIVATION_INPUT_COST is the iteration count.
 *   This input step must be used exactly once.
 * - #IFX_SE_KEY_DERIVATION_INPUT_SALT is the salt.
 *   This input step must be used one or more times; if used several times, the
 *   inputs will be concatenated. This can be used to build the final salt
 *   from multiple sources, both public and secret (also known as pepper).
 * - #IFX_SE_KEY_DERIVATION_INPUT_PASSWORD is the password to be hashed.
 *   This input step must be used exactly once.
 *
 * \param hash_alg      A hash algorithm (\c IFX_SE_ALG_XXX value such that
 *                      #IFX_SE_ALG_IS_HASH(\p hash_alg) is true).
 *
 * \return              The corresponding PBKDF2-HMAC algorithm.
 * \return              Unspecified if \p hash_alg is not a supported
 *                      hash algorithm.
 */
#define IFX_SE_ALG_PBKDF2_HMAC(hash_alg)                                  \
    (IFX_SE_ALG_PBKDF2_HMAC_BASE | ((hash_alg) & IFX_SE_ALG_HASH_MASK))

/** Whether the specified algorithm is a PBKDF2-HMAC algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is a PBKDF2-HMAC algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key derivation algorithm identifier.
 */
#define IFX_SE_ALG_IS_PBKDF2_HMAC(alg)                                    \
    (((alg) & ~IFX_SE_ALG_HASH_MASK) == IFX_SE_ALG_PBKDF2_HMAC_BASE)

/** The PBKDF2-AES-CMAC-PRF-128 password hashing / key stretching algorithm.
 *
 * PBKDF2 is defined by PKCS#5, republished as RFC 8018 (section 5.2).
 * This macro specifies the PBKDF2 algorithm constructed using the
 * AES-CMAC-PRF-128 PRF specified by RFC 4615.
 *
 * This key derivation algorithm uses the same inputs as
 * #IFX_SE_ALG_PBKDF2_HMAC() with the same constraints.
 */
#define IFX_SE_ALG_PBKDF2_AES_CMAC_PRF_128         ((ifx_se_algorithm_t)0x08800200)

