PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** The CMAC KDF algorithm
 *
 * Key derivation in Counter Mode using CMAC as pseudo random function (PRF)
 * is defined in NIST SP 800-108 section 4.1.
 *
 * This key derivation algorithm uses the following inputs
 * - #IFX_SE_KEY_DERIVATION_INPUT_SECRET is the key derivation key. It is a key
 *   that is used as an input to a key-derivation function (along with other
 *   input data) to derive keying material.
 * - #IFX_SE_KEY_DERIVATION_INPUT_LABEL is a string that identifies the purpose
 *   for the derived keying material, which is encoded as a bit string.
 *   The encoding method for the Label is defined in a larger context,
 *   for example, in the protocol that uses a KDF.
 *   This input is optional.
 * - #IFX_SE_KEY_DERIVATION_INPUT_SEED is a bit string that is used to seed the
 *   PRF. This input is optional.
 */
#define IFX_SE_ALG_KDF_AES_CMAC                    ((ifx_se_algorithm_t)0x08000600)

/** Macro to build a combined algorithm that chains a key agreement with
 * a key derivation.
 *
 * \param ka_alg        A key agreement algorithm (\c IFX_SE_ALG_XXX value such
 *                      that #IFX_SE_ALG_IS_KEY_AGREEMENT(\p ka_alg) is true).
 * \param kdf_alg       A key derivation algorithm (\c IFX_SE_ALG_XXX value such
 *                      that #IFX_SE_ALG_IS_KEY_DERIVATION(\p kdf_alg) is true).
 *
 * \return              The corresponding key agreement and derivation
 *                      algorithm.
 * \return              Unspecified if \p ka_alg is not a supported
 *                      key agreement algorithm or \p kdf_alg is not a
 *                      supported key derivation algorithm.
 */
#define IFX_SE_ALG_KEY_AGREEMENT(ka_alg, kdf_alg)  \
    ((ka_alg) | (kdf_alg))

/** \cond INTERNAL */
#define IFX_SE_ALG_KEY_DERIVATION_MASK             ((ifx_se_algorithm_t)0xfe00ffffU)
#define IFX_SE_ALG_KEY_AGREEMENT_MASK              ((ifx_se_algorithm_t)0xffff0000U)

#define IFX_SE_ALG_KEY_AGREEMENT_GET_KDF(alg)                              \
    (((alg) & IFX_SE_ALG_KEY_DERIVATION_MASK) | IFX_SE_ALG_CATEGORY_KEY_DERIVATION)

#define IFX_SE_ALG_KEY_AGREEMENT_GET_BASE(alg)                             \
    (((alg) & IFX_SE_ALG_KEY_AGREEMENT_MASK) | IFX_SE_ALG_CATEGORY_KEY_AGREEMENT)

#define IFX_SE_ALG_IS_KEY_DERIVATION_OR_AGREEMENT(alg)     \
    ((IFX_SE_ALG_IS_KEY_DERIVATION(alg) || IFX_SE_ALG_IS_KEY_AGREEMENT(alg)))
/** \endcond */

/** Whether the specified algorithm is a raw key agreement algorithm.
 *
 * A raw key agreement algorithm is one that does not specify
 * a key derivation function.
 * Usually, raw key agreement algorithms are constructed directly with
 * a \c IFX_SE_ALG_xxx macro while non-raw key agreement algorithms are
 * constructed with #IFX_SE_ALG_KEY_AGREEMENT().
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \p alg is a raw key agreement algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \p alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_RAW_KEY_AGREEMENT(alg)                               \
    (IFX_SE_ALG_IS_KEY_AGREEMENT(alg) &&                                   \
     IFX_SE_ALG_KEY_AGREEMENT_GET_KDF(alg) == IFX_SE_ALG_CATEGORY_KEY_DERIVATION)

/** The finite-field Diffie-Hellman (DH) key agreement algorithm.
 *
 * The shared secret produced by key agreement is
 * `g^{ab}` in big-endian format.
 * It is `ceiling(m / 8)` bytes long where `m` is the size of the prime `p`
 * in bits.
 */
#define IFX_SE_ALG_FFDH                            ((ifx_se_algorithm_t)0x09010000)

/** Whether the specified algorithm is a finite field Diffie-Hellman algorithm.
 *
 * This includes the raw finite field Diffie-Hellman algorithm as well as
 * finite-field Diffie-Hellman followed by any supporter key derivation
 * algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is a finite field Diffie-Hellman algorithm, 0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key agreement algorithm identifier.
 */
#define IFX_SE_ALG_IS_FFDH(alg) \
    (IFX_SE_ALG_KEY_AGREEMENT_GET_BASE(alg) == IFX_SE_ALG_FFDH)

/** The elliptic curve Diffie-Hellman (ECDH) key agreement algorithm.
 *
 * The shared secret produced by key agreement is the x-coordinate of
 * the shared secret point. It is always `ceiling(m / 8)` bytes long where
 * `m` is the bit size associated with the curve, i.e. the bit size of the
 * order of the curve's coordinate field. When `m` is not a multiple of 8,
 * the byte containing the most significant bit of the shared secret
 * is padded with zero bits. The byte order is either little-endian
 * or big-endian depending on the curve type.
 *
 * - For Montgomery curves (curve types `IFX_SE_ECC_FAMILY_CURVEXXX`),
 *   the shared secret is the x-coordinate of `d_A Q_B = d_B Q_A`
 *   in little-endian byte order.
 *   The bit size is 448 for Curve448 and 255 for Curve25519.
 * - For Weierstrass curves over prime fields (curve types
 *   `IFX_SE_ECC_FAMILY_SECPXXX` and `IFX_SE_ECC_FAMILY_BRAINPOOL_PXXX`),
 *   the shared secret is the x-coordinate of `d_A Q_B = d_B Q_A`
 *   in big-endian byte order.
 *   The bit size is `m = ceiling(log_2(p))` for the field `F_p`.
 * - For Weierstrass curves over binary fields (curve types
 *   `IFX_SE_ECC_FAMILY_SECTXXX`),
 *   the shared secret is the x-coordinate of `d_A Q_B = d_B Q_A`
 *   in big-endian byte order.
 *   The bit size is `m` for the field `F_{2^m}`.
 */
#define IFX_SE_ALG_ECDH                            ((ifx_se_algorithm_t)0x09020000)

/** Whether the specified algorithm is an elliptic curve Diffie-Hellman
 * algorithm.
 *
 * This includes the raw elliptic curve Diffie-Hellman algorithm as well as
 * elliptic curve Diffie-Hellman followed by any supporter key derivation
 * algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is an elliptic curve Diffie-Hellman algorithm,
 *         0 otherwise.
 *         This macro may return either 0 or 1 if \c alg is not a supported
 *         key agreement algorithm identifier.
 */
#define IFX_SE_ALG_IS_ECDH(alg) \
    (IFX_SE_ALG_KEY_AGREEMENT_GET_BASE(alg) == IFX_SE_ALG_ECDH)

/** Whether the specified algorithm encoding is a wildcard.
 *
 * Wildcard values may only be used to set the usage algorithm field in
 * a policy, not to perform an operation.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return 1 if \c alg is a wildcard algorithm encoding.
 * \return 0 if \c alg is a non-wildcard algorithm encoding (suitable for
 *         an operation).
 * \return This macro may return either 0 or 1 if \c alg is not a supported
 *         algorithm identifier.
 */
#define IFX_SE_ALG_IS_WILDCARD(alg)                            \
    (IFX_SE_ALG_IS_HASH_AND_SIGN(alg) ?                        \
     IFX_SE_ALG_SIGN_GET_HASH(alg) == IFX_SE_ALG_ANY_HASH :       \
     IFX_SE_ALG_IS_MAC(alg) ?                                  \
     (alg & IFX_SE_ALG_MAC_AT_LEAST_THIS_LENGTH_FLAG) != 0 :   \
     IFX_SE_ALG_IS_AEAD(alg) ?                                 \
     (alg & IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG) != 0 :  \
     (alg) == IFX_SE_ALG_ANY_HASH)

/** Get the hash used by a composite algorithm.
 *
 * \param alg An algorithm identifier (value of type #ifx_se_algorithm_t).
 *
 * \return The underlying hash algorithm if alg is a composite algorithm that
 * uses a hash algorithm.
 *
 * \return \c 0 if alg is not a composite algorithm that uses a hash.
 */
#define IFX_SE_ALG_GET_HASH(alg) \
        (((alg) & 0x000000ff) == 0 ? ((ifx_se_algorithm_t)0) : 0x02000000 | ((alg) & 0x000000ff))

/**@}*/

/** \addtogroup key_lifetimes Key lifetimes
 * @{
 */

/** The default lifetime for volatile keys.
 *
 * A volatile key only exists as long as the identifier to it is not destroyed.
 * The key material is guaranteed to be erased on a power reset.
 *
 * A key with this lifetime is typically stored in the RAM area of the
 * PSA Crypto subsystem. However this is an implementation choice.
 * If an implementation stores data about the key in a non-volatile memory,
 * it must release all the resources associated with the key and erase the
 * key material if the calling application terminates.
 */
#define IFX_SE_KEY_LIFETIME_VOLATILE               ((ifx_se_key_lifetime_t)0x00000000)

