PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** The default lifetime for persistent keys.
 *
 * A persistent key remains in storage until it is explicitly destroyed or
 * until the corresponding storage area is wiped. This specification does
 * not define any mechanism to wipe a storage area, but integrations may
 * provide their own mechanism (for example to perform a factory reset,
 * to prepare for device refurbishment, or to uninstall an application).
 *
 * This lifetime value is the default storage area for the calling
 * application. Integrations of Mbed TLS may support other persistent lifetimes.
 * See ::ifx_se_key_lifetime_t for more information.
 */
#define IFX_SE_KEY_LIFETIME_PERSISTENT             ((ifx_se_key_lifetime_t)0x00000001)

/** The persistence level of volatile keys.
 *
 * See ::ifx_se_key_persistence_t for more information.
 */
#define IFX_SE_KEY_PERSISTENCE_VOLATILE            ((ifx_se_key_persistence_t)0x00)

/** The default persistence level for persistent keys.
 *
 * See ::ifx_se_key_persistence_t for more information.
 */
#define IFX_SE_KEY_PERSISTENCE_DEFAULT             ((ifx_se_key_persistence_t)0x01)

/** A persistence level indicating that a key is never destroyed.
 *
 * See ::ifx_se_key_persistence_t for more information.
 */
#define IFX_SE_KEY_PERSISTENCE_READ_ONLY           ((ifx_se_key_persistence_t)0xff)

/** See ::ifx_se_key_persistence_t for more information. */
#define IFX_SE_KEY_LIFETIME_GET_PERSISTENCE(lifetime)      \
    ((ifx_se_key_persistence_t)((lifetime) & 0x000000ffuL))

/** See ::ifx_se_key_persistence_t for more information. */
#define IFX_SE_KEY_LIFETIME_GET_LOCATION(lifetime)      \
    ((ifx_se_key_location_t)((lifetime) >> 8))

/** Whether a key lifetime indicates that the key is volatile.
 *
 * A volatile key is automatically destroyed by the implementation when
 * the application instance terminates. In particular, a volatile key
 * is automatically destroyed on a power reset of the device.
 *
 * A key that is not volatile is persistent. Persistent keys are
 * preserved until the application explicitly destroys them or until an
 * implementation-specific device management event occurs (for example,
 * a factory reset).
 *
 * \param lifetime      The lifetime value to query (value of type
 *                      ::ifx_se_key_lifetime_t).
 *
 * \return \c 1 if the key is volatile, otherwise \c 0.
 */
#define IFX_SE_KEY_LIFETIME_IS_VOLATILE(lifetime)  \
    (IFX_SE_KEY_LIFETIME_GET_PERSISTENCE(lifetime) == \
     IFX_SE_KEY_PERSISTENCE_VOLATILE)

/** Whether a key lifetime indicates that the key is read-only.
 *
 * Read-only keys cannot be created or destroyed through the PSA Crypto API.
 * They must be created through platform-specific means that bypass the API.
 *
 * Some platforms may offer ways to destroy read-only keys. For example,
 * consider a platform with multiple levels of privilege, where a
 * low-privilege application can use a key but is not allowed to destroy
 * it, and the platform exposes the key to the application with a read-only
 * lifetime. High-privilege code can destroy the key even though the
 * application sees the key as read-only.
 *
 * \param lifetime      The lifetime value to query (value of type
 *                      ::ifx_se_key_lifetime_t).
 *
 * \return \c 1 if the key is read-only, otherwise \c 0.
 */
#define IFX_SE_KEY_LIFETIME_IS_READ_ONLY(lifetime)  \
    (IFX_SE_KEY_LIFETIME_GET_PERSISTENCE(lifetime) == \
     IFX_SE_KEY_PERSISTENCE_READ_ONLY)

/** Construct a lifetime from a persistence level and a location.
 *
 * \param persistence   The persistence level
 *                      (value of type ::ifx_se_key_persistence_t).
 * \param location      The location indicator
 *                      (value of type ::ifx_se_key_location_t).
 *
 * \return The constructed lifetime value.
 */
#define IFX_SE_KEY_LIFETIME_FROM_PERSISTENCE_AND_LOCATION(persistence, location) \
    (((location) << 8) | (persistence))

/** The local storage area for persistent keys.
 *
 * This storage area is available on all systems that can store persistent
 * keys without delegating the storage to a third-party cryptoprocessor.
 *
 * See ::ifx_se_key_location_t for more information.
 */
#define IFX_SE_KEY_LOCATION_LOCAL_STORAGE          ((ifx_se_key_location_t)0x000000)

/** \cond INTERNAL */
#define IFX_SE_KEY_LOCATION_VENDOR_FLAG            ((ifx_se_key_location_t)0x800000)
/** \endcond */

/** The SE RT Services storage area.
 *
 * See ::ifx_se_key_location_t for more information.
 */
#define IFX_SE_KEY_LOCATION_SE                     ((ifx_se_key_location_t)0x800001)

/**@}*/

/** \addtogroup key_attributes
 * @{
 */

/** The null key identifier.
 */
#define IFX_SE_KEY_ID_NULL                         ((ifx_se_key_id_t)0)
/** The minimum value for a key identifier chosen by the application.
 */
#define IFX_SE_KEY_ID_USER_MIN                     ((ifx_se_key_id_t)0x00000001)
/** The maximum value for a key identifier chosen by the application.
 */
#define IFX_SE_KEY_ID_USER_MAX                     ((ifx_se_key_id_t)0x3fffffff)
/** The minimum value for a key identifier chosen by the implementation.
 */
#define IFX_SE_KEY_ID_VENDOR_MIN                   ((ifx_se_key_id_t)0x40000000)
/** The maximum value for a key identifier chosen by the implementation.
 */
#define IFX_SE_KEY_ID_VENDOR_MAX                   ((ifx_se_key_id_t)0x7fffffff)

/** \cond INTERNAL */
#define IFX_SE_SVC_KEY_ID_INIT { 0, 0 }

#define IFX_SE_SVC_KEY_ID_GET_KEY_ID(id) ((id).key_id)
#define IFX_SE_SVC_KEY_ID_GET_OWNER_ID(id) ((id).owner)
/** \endcond */

/** Utility to initialize a key identifier at runtime.
 *
 * \param owner_id Identifier of the key owner.
 * \param key_id   Identifier of the key.
 * \return Key identifier value
 */
static inline ifx_se_svc_key_id_t ifx_se_svc_key_id_make(
    ifx_se_key_owner_id_t owner_id, ifx_se_key_id_t key_id)
{
    return (ifx_se_svc_key_id_t)
    {
        .key_id = key_id,
        .owner = owner_id
    };
}

/**@}*/

/** \addtogroup key_policy
 * @{
 */

/** Whether the key may be exported.
 *
 * A public key or the public part of a key pair may always be exported
 * regardless of the value of this permission flag.
 *
 * If a key does not have export permission, implementations shall not
 * allow the key to be exported in plain form from the cryptoprocessor,
 * whether through ifx_se_export_key() or through a proprietary interface.
 * The key may however be exportable in a wrapped form, i.e. in a form
 * where it is encrypted by another key.
 */
#define IFX_SE_KEY_USAGE_EXPORT                    ((ifx_se_key_usage_t)0x00000001)

/** Whether the key may be copied.
 *
 * This flag allows the use of ifx_se_copy_key() to make a copy of the key
 * with the same policy or a more restrictive policy.
 *
 * For lifetimes for which the key is located in a secure element which
 * enforce the non-exportability of keys, copying a key outside the secure
 * element also requires the usage flag #IFX_SE_KEY_USAGE_EXPORT.
 * Copying the key inside the secure element is permitted with just
 * #IFX_SE_KEY_USAGE_COPY if the secure element supports it.
 * For keys with the lifetime #IFX_SE_KEY_LIFETIME_VOLATILE or
 * #IFX_SE_KEY_LIFETIME_PERSISTENT, the usage flag #IFX_SE_KEY_USAGE_COPY
 * is sufficient to permit the copy.
 */
#define IFX_SE_KEY_USAGE_COPY                      ((ifx_se_key_usage_t)0x00000002)

/** Whether the key may be used to encrypt a message.
 *
 * This flag allows the key to be used for a symmetric encryption operation,
 * for an AEAD encryption-and-authentication operation,
 * or for an asymmetric encryption operation,
 * if otherwise permitted by the key's type and policy.
 *
 * For a key pair, this concerns the public key.
 */
#define IFX_SE_KEY_USAGE_ENCRYPT                   ((ifx_se_key_usage_t)0x00000100)

/** Whether the key may be used to decrypt a message.
 *
 * This flag allows the key to be used for a symmetric decryption operation,
 * for an AEAD decryption-and-verification operation,
 * or for an asymmetric decryption operation,
 * if otherwise permitted by the key's type and policy.
 *
 * For a key pair, this concerns the private key.
 */
#define IFX_SE_KEY_USAGE_DECRYPT                   ((ifx_se_key_usage_t)0x00000200)

