PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_psacrypto_values.h
/** Whether the key may be used to sign a message.
 *
 * This flag allows the key to be used for a MAC calculation operation or for
 * an asymmetric message signature operation, if otherwise permitted by the
 * key's type and policy.
 *
 * For a key pair, this concerns the private key.
 */
#define IFX_SE_KEY_USAGE_SIGN_MESSAGE              ((ifx_se_key_usage_t)0x00000400)

/** Whether the key may be used to verify a message.
 *
 * This flag allows the key to be used for a MAC verification operation or for
 * an asymmetric message signature verification operation, if otherwise
 * permitted by the key's type and policy.
 *
 * For a key pair, this concerns the public key.
 */
#define IFX_SE_KEY_USAGE_VERIFY_MESSAGE            ((ifx_se_key_usage_t)0x00000800)

/** Whether the key may be used to sign a message.
 *
 * This flag allows the key to be used for a MAC calculation operation
 * or for an asymmetric signature operation,
 * if otherwise permitted by the key's type and policy.
 *
 * For a key pair, this concerns the private key.
 */
#define IFX_SE_KEY_USAGE_SIGN_HASH                 ((ifx_se_key_usage_t)0x00001000)

/** Whether the key may be used to verify a message signature.
 *
 * This flag allows the key to be used for a MAC verification operation
 * or for an asymmetric signature verification operation,
 * if otherwise permitted by by the key's type and policy.
 *
 * For a key pair, this concerns the public key.
 */
#define IFX_SE_KEY_USAGE_VERIFY_HASH               ((ifx_se_key_usage_t)0x00002000)

/** Whether the key may be used to derive other keys or produce a password
 * hash.
 *
 * This flag allows the key to be used for a key derivation operation or for
 * a key agreement operation, if otherwise permitted by by the key's type and
 * policy.
 *
 * If this flag is present on all keys used in calls to
 * ifx_se_key_derivation_input_key() for a key derivation operation, then it
 * permits calling ifx_se_key_derivation_output_bytes() or
 * ifx_se_key_derivation_output_key() at the end of the operation.
 */
#define IFX_SE_KEY_USAGE_DERIVE                    ((ifx_se_key_usage_t)0x00004000)

/** Whether the key may be used to verify the result of a key derivation,
 * including password hashing.
 *
 * This flag allows the key to be used:
 *
 * This flag allows the key to be used in a key derivation operation, if
 * otherwise permitted by by the key's type and policy.
 *
 * If this flag is present on all keys used in calls to
 * ifx_se_key_derivation_input_key() for a key derivation operation, then it
 * permits calling ifx_se_key_derivation_verify_bytes() or
 * ifx_se_key_derivation_verify_key() at the end of the operation.
 */
#define IFX_SE_KEY_USAGE_VERIFY_DERIVATION         ((ifx_se_key_usage_t)0x00008000)

/**@}*/

/** \addtogroup key_derivation Key derivation
 * @{
 */

/** A secret input for key derivation.
 *
 * This should be a key of type #IFX_SE_KEY_TYPE_DERIVE
 * (passed to ifx_se_key_derivation_input_key())
 * or the shared secret resulting from a key agreement
 * (obtained via ifx_se_key_derivation_key_agreement()).
 *
 * The secret can also be a direct input (passed to
 * key_derivation_input_bytes()). In this case, the derivation operation
 * may not be used to derive keys: the operation will only allow
 * ifx_se_key_derivation_output_bytes(),
 * ifx_se_key_derivation_verify_bytes(), or
 * ifx_se_key_derivation_verify_key(), but not
 * ifx_se_key_derivation_output_key().
 */
#define IFX_SE_KEY_DERIVATION_INPUT_SECRET     ((ifx_se_key_derivation_step_t)0x0101)

/** A low-entropy secret input for password hashing / key stretching.
 *
 * This is usually a key of type #IFX_SE_KEY_TYPE_PASSWORD (passed to
 * ifx_se_key_derivation_input_key()) or a direct input (passed to
 * ifx_se_key_derivation_input_bytes()) that is a password or passphrase. It can
 * also be high-entropy secret such as a key of type #IFX_SE_KEY_TYPE_DERIVE or
 * the shared secret resulting from a key agreement.
 *
 * The secret can also be a direct input (passed to
 * key_derivation_input_bytes()). In this case, the derivation operation
 * may not be used to derive keys: the operation will only allow
 * ifx_se_key_derivation_output_bytes(),
 * ifx_se_key_derivation_verify_bytes(), or
 * ifx_se_key_derivation_verify_key(), but not
 * ifx_se_key_derivation_output_key().
 */
#define IFX_SE_KEY_DERIVATION_INPUT_PASSWORD   ((ifx_se_key_derivation_step_t)0x0102)

/** A high-entropy additional secret input for key derivation.
 *
 * This is typically the shared secret resulting from a key agreement obtained
 * via `ifx_se_key_derivation_key_agreement()`. It may alternatively be a key of
 * type `IFX_SE_KEY_TYPE_DERIVE` passed to `ifx_se_key_derivation_input_key()`, or
 * a direct input passed to `ifx_se_key_derivation_input_bytes()`.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_OTHER_SECRET \
                                            ((ifx_se_key_derivation_step_t)0x0103)

/** A label for key derivation.
 *
 * This should be a direct input.
 * It can also be a key of type #IFX_SE_KEY_TYPE_RAW_DATA.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_LABEL      ((ifx_se_key_derivation_step_t)0x0201)

/** A salt for key derivation.
 *
 * This should be a direct input.
 * It can also be a key of type #IFX_SE_KEY_TYPE_RAW_DATA or
 * #IFX_SE_KEY_TYPE_PEPPER.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_SALT       ((ifx_se_key_derivation_step_t)0x0202)

/** An information string for key derivation.
 *
 * This should be a direct input.
 * It can also be a key of type #IFX_SE_KEY_TYPE_RAW_DATA.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_INFO       ((ifx_se_key_derivation_step_t)0x0203)

/** A seed for key derivation.
 *
 * This should be a direct input.
 * It can also be a key of type #IFX_SE_KEY_TYPE_RAW_DATA.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_SEED       ((ifx_se_key_derivation_step_t)0x0204)

/** A cost parameter for password hashing / key stretching.
 *
 * This must be a direct input, passed to ifx_se_key_derivation_input_integer().
 */
#define IFX_SE_KEY_DERIVATION_INPUT_COST       ((ifx_se_key_derivation_step_t)0x0205)

/**
 * Fixed data for the key derivation.
 *
 * This should be a direct input.
 */
#define IFX_SE_KEY_DERIVATION_INPUT_FIXED_DATA ((ifx_se_key_derivation_step_t)0x0206)

/**@}*/

/** \addtogroup crypto_algs
 * @{
 */

/** Check if two AEAD algorithm identifiers refer to the same AEAD algorithm
 *  regardless of the tag length they encode.
 *
 * \param aead_alg_1 An AEAD algorithm identifier.
 * \param aead_alg_2 An AEAD algorithm identifier.
 *
 * \return           1 if both identifiers refer to the same AEAD algorithm,
 *                   0 otherwise.
 *                   Unspecified if neither \p aead_alg_1 nor \p aead_alg_2 are
 *                   a supported AEAD algorithm.
 */
#define IFX_SE_ALG_AEAD_EQUAL(aead_alg_1, aead_alg_2) \
    (!(((aead_alg_1) ^ (aead_alg_2)) & \
       ~(IFX_SE_ALG_AEAD_TAG_LENGTH_MASK | IFX_SE_ALG_AEAD_AT_LEAST_THIS_LENGTH_FLAG)))

/**@}*/

/** \addtogroup key_attributes
 * @{
 */

